/*
================================================================================
檔案代號:sfb_file
檔案名稱:工单档
檔案目的:
上游檔案:
下游檔案:
檔案類型:T
多語系檔案:N
============.========================.==========================================
*/
create table sfb_file
(
sfb01       varchar2(20) NOT NULL,   /*工单编号                               */
                                     /*工單編號                               */
sfb02       number(5),               /*工单类型                               */
                                     /*工單型態                               */
                                     /*儲存該工單所屬類別型態                 */
                                     /*正確值 1/2/5/7/11/12/13/15             */
                                     /* 1: 一般工單                           */
                                     /* 5: 再加工工單                         */
                                     /* 7: 委外工單                           */
                                     /* 8: 重工委外工單   #Add By Snow        */
                                     /*11: 拆件式工單                         */
                                     /*13: 預測工單                           */
                                     /*15: 試產工單                           */
sfb03       varchar2(24),            /*在制品会计科目                         */
                                     /*在製品會計科目  aag01                  */
sfb04       varchar2(1),             /*工单状态                               */
                                     /*工單狀態                               */
                                     /*儲存該工單目前處理階段狀況             */
                                     /*正確值 1/2/3/4/5/6/7/8                 */
                                     /*1: 確認生產工單(firm plan)             */
                                     /*2: 工單已發放,料表尚未列印             */
                                     /*3: 工單已發放,料表已列印               */
                                     /*4: 工單已發料                          */
                                     /*5: 在製過程中                          */
                                     /*6: 工單已完工,進入F.Q.C                */
                                     /*7: 完工入庫                            */
                                     /*8: 結案                                */
sfb05       varchar2(40),            /*料件编号                               */
                                     /*料件編號   ima01                       */
                                     /*儲存該工單將投入生產料件               */
sfb06       varchar2(10),            /*使用工艺编号                           */
                                     /*使用製程編號  ecu01                    */
                                     /*儲存該工單將投入生產料件時所用的製程編 */
                                     /*號                                     */
sfb07       varchar2(10),            /*版本                                   */
                                     /*儲存工單投入生產的料件版本             */
sfb071      date,                    /*产品结构指定有效日期                   */
                                     /*產品結構指定有效日期                   */
                                     /*儲存工單投入生產的料件使用的產品結構指 */
                                     /*定有效日期                             */
sfb08       number(15,3) NOT NULL,   /*生产数量                               */
                                     /*生產數量                               */
                                     /*預計投入生產的數量，單位為料件生產單位 */
sfb081      number(15,3) NOT NULL,   /*已发料套数                             */
                                     /*已發料套數                             */
sfb09       number(15,3) NOT NULL,   /*完工入库数量                           */
                                     /*完工入庫數量                           */
                                     /*儲存該工單已完工入庫數量               */
sfb10       number(15,3) NOT NULL,   /*返工数量                               */
                                     /*再加工數量                             */
                                     /*儲存該工單再加工數量                   */
sfb11       number(15,3) NOT NULL,   /*F.Q.C 数量                             */
                                     /*F.Q.C 數量                             */
                                     /*儲存該工單在全檢（檢驗）數量           */
sfb111      number(15,3) NOT NULL,   /*No Use                                 */
                                     /*no use 02/06/10 modify                 */
sfb12       number(15,3) NOT NULL,   /*报废数量                               */
                                     /*報廢數量                               */
                                     /*儲存該工單報廢數量                     */
sfb121      number(15,3),            /*在制盘盈亏量                           */
                                     /*在製盤盈虧量  add 99/04/27             */
sfb122      number(15,3),            /*No Use                                 */
sfb13       date,                    /*预计起始生产日期                       */
                                     /*預計起始生產日期                       */
                                     /*儲存該工單預計投入生產日期             */
sfb14       varchar2(5),             /*预计起始生产时间                       */
                                     /*預計起始生產時間(時:分)                */
                                     /*儲存該工單預計投入生產時間             */
sfb15       date,                    /*预计结束生产日期                       */
                                     /*預計結束生產日期                       */
                                     /*儲存該工單預計完成生產日期             */
sfb16       varchar2(5),             /*预计结束生产时间                       */
                                     /*預計結束生產時間(時:分)                */
                                     /*儲存該工單預計完成生產時間             */
sfb17       number(5),               /*已完工工艺序号                         */
                                     /*已完工製程序號                         */
                                     /*儲存該工單目前已完工的最大製程序號     */
sfb18       date,                    /*最近一次作业完工日期                   */
                                     /*最近一次作業完工日期(天)               */
                                     /*儲存該工單 [已完工製程序號] 之完工日期 */
sfb19       varchar2(5),             /*最近一次作业完工时间                   */
                                     /*最近一次作業完工時間(時:分)            */
                                     /*儲存該工單 [已完工製程序號] 之完工時間 */
                                     /*量產系統專用                           */
sfb20       date,                    /*MPS/MRP 需求日期                       */
                                     /*儲存該工單之預計 MPS/MPR 需求日期      */
sfb21       varchar2(5),             /*MPS/MRP 需求时间                       */
                                     /*MPS/MRP 需求時間(時:分)                */
                                     /*儲存該工單之預計 MPS/MPR 需求時間      */
                                     /*量產系統專用                           */
sfb22       varchar2(20),            /*订单编号/预测工单编号                  */
                                     /*訂單編號/預測工單編號                  */
                                     /*儲存該工單之指定生產供給的訂單單號     */
sfb221      number(5),               /*订单项次/预测工单项次                  */
                                     /*訂單項次/預測工單項次                  */
                                     /*儲存該工單之指定生產供給的訂單項次     */
sfb222      varchar2(20),            /*APS 单据编号                           */
sfb23       varchar2(1),             /*备料档生成否                           */
                                     /*備料檔產生否                           */
                                     /*儲存該工單是否已產生備料資料           */
                                     /*正確值 Y/N                             */
                                     /*Y: 該工單已產生備料資料                */
                                     /*N: 該工單尚未產生備料資料              */
sfb24       varchar2(1),             /*工艺追踪档生成否                       */
                                     /*製程追蹤檔產生否                       */
                                     /*儲存該工單是否已產生製程追蹤資料       */
                                     /*正確值 Y/N                             */
                                     /*Y: 該工單已產生製程追蹤資料            */
                                     /*N: 該工單尚未產生製程追蹤資料          */
sfb25       date,                    /*实际开工日                             */
                                     /*實際開工日                             */
                                     /*儲存該工單第一次發料日期, 於發料作業更新*/
sfb251      date,                    /*预计发放日期                           */
                                     /*預計發放日期                           */
sfb26       varchar2(5),             /*发料日期                               */
sfb27       varchar2(10),            /*项目号码                               */
                                     /*專案號碼                               */
                                     /*儲存該工單所屬專案號碼                 */
sfb271      varchar2(30),            /*WBS编码                                */
                                     /*專案號碼-順序                          */
                                     /*儲存該工單所屬專案號碼-順序            */
sfb28       varchar2(1),             /*工单结案状态                           */
                                     /*工單結案狀態                           */
                                     /*正確值 1/2/3                           */
                                     /*1: 發料已結束,不能再發料               */
                                     /*2: 生產工時已結束,不能再發料及輸入工時 */
                                     /*3: 成本會計已結束,此工單不能再重新開啟 */
                                     /*   ，可轉入歷史檔                      */
sfb29       varchar2(1),             /*可用否                                 */
                                     /*儲存執行主排程計劃或料需求計劃時，是否 */
                                     /*可考慮將該工單完工數量列入需求之供給   */
                                     /*正確值 Y/N                             */
                                     /*Y: 可考慮為供給                        */
                                     /*N: 不可考慮為供給                      */
sfb30       varchar2(10),            /*预计工单完工入库仓库                   */
                                     /*預計工單完工入庫倉庫別                 */
                                     /*儲存該工單完工後，預計存放的倉庫別     */
sfb31       varchar2(10),            /*预计工单完工入库库位                   */
                                     /*預計工單完工入庫儲位                   */
                                     /*儲存該工單完工後，預計存放的儲位       */
sfb32       varchar2(2),             /*起始排程方法                           */
                                     /*正確值 1/2/3/4/5                       */
                                     /*1: window scheduling forward           */
                                     /*2: window scheduling backward          */
                                     /*3: weighted window scheduling          */
                                     /*4: tracking scheduling forward         */
                                     /*5: tracking scheduling backward        */
sfb33       varchar2(2),             /*最近排程方法                           */
                                     /*正確值 1/2/3/4/5                       */
                                     /*1: window scheduling forward           */
                                     /*2: window scheduling backward          */
                                     /*3: weighted window scheduling          */
                                     /*4: tracking scheduling forward         */
                                     /*5: tracking scheduling backward        */
sfb34       number(9,4),             /*C/R 比率                               */
                                     /*C/R 比率(%)                            */
                                     /*儲存該工單緊急比率                     */
                                     /*開始時應設定為 '1'，可透過工單緊急比率 */
                                     /*重新計算作業重新設定                   */
                                     /*其值愈小者，賦予愈高的分派優先順序     */
sfb35       varchar2(1),             /*核算项                                 */
                                     /*異動碼(Y/N)                            */
                                     /*儲存該工單自上次料需求計劃後，如有變動 */
                                     /*時，則需在此備註                       */
                                     /*提供 nettable change MRP 使用          */
sfb36       date,                    /*工单发料结束日期                       */
                                     /*工單發料結束日期                       */
                                     /*按工單結案狀況，會有各階段結束日期；而 */
                                     /*本欄位記錄料帳結束日期，即在工單經過此 */
                                     /*階段後，系統即便不可再發料給該工單     */
                                     /*如需再發料，則需作工單的重新開啟作業， */
                                     /*才被允許可再發料給該工單               */
sfb37       date,                    /*工单发料及工时结束日                   */
                                     /*工單發料及工時結束日                   */
                                     /*按工單結案狀況，會有各階段結束日期；而 */
                                     /*本欄位記錄料帳及人工帳（工時）結束日期 */
                                     /*，簡而言之即在工單經過此階段後，系統即 */
                                     /*便不可再對該工單收集工時               */
                                     /*如需再收集工時，則需作工單的重新開啟作 */
                                     /*業，才被允許可再收集工時給該工單       */
sfb38       date,                    /*工单成本会计结束日期                   */
                                     /*工單成本會計結束日期                   */
                                     /*按工單結案狀況，會有各階段結束日期；而 */
                                     /*本欄位記錄該工單已在最後確定的階段日期 */
                                     /*，簡而言之即在工單經過此階段後，系統即 */
                                     /*便不可再對該工單發料及收集工時，而且亦 */
                                     /*無法再重新開啟                         */
sfb39       varchar2(1),             /*完工方式                               */
                                     /*儲存該工單在料帳上，使用撿料及發料系統 */
                                     /*或使用領料及事後扣帳系統               */
                                     /*正確值 1/2                             */
                                     /*1: 撿料及發料系統                      */
                                     /*   Picking List 與 Push System         */
                                     /*2: 領料及事後扣帳系統                  */
                                     /*   Pull List 與 Backflush System       */
sfb40       number(5),               /*优先顺序                               */
                                     /*優先順序                               */
                                     /*儲存該工單派工的優先順序               */
                                     /*正確值 應不小於零                      */
                                     /*其值愈小者順序愈高                     */
sfb41       varchar2(1),             /*冻结码                                 */
                                     /*凍結碼(frozen flag)                    */
                                     /*儲存該工單為需求之供給時，是否可更動其 */
                                     /*時程，以利需求之取得                   */
                                     /*正確值 Y/N                             */
                                     /*Y: 時程已被固定之工單                  */
                                     /*N: 時程尚未被固定之工單                */
sfb42       number(5),               /*工单展开阶数                           */
                                     /*工單展開階數                           */
                                     /*儲存該工單對下階自動產生工單的往下階數 */
sfb81       date,                    /*录入日期                               */
                                     /*輸入日期                               */
                                     /*儲存工單輸入日期                       */
sfb82       varchar2(10),            /*制造部门/委外厂商                      */
                                     /*製造部門/委外廠商                      */
sfb85       varchar2(20),            /*料表批号(Picking Batch ID)             */
sfb86       varchar2(20),            /*母工单号码                             */
                                     /*母工單號碼                             */
sfb87       varchar2(1),             /*审核否                                 */
                                     /*確認否(Y/N/X)                          */
sfb88       varchar2(20),            /*料表编号                               */
                                     /*料表編號                               */
sfb91       varchar2(20),            /*制造通知单                             */
                                     /*製造通知單                             */
sfb92       number(5),               /*项次                                   */
                                     /*項次                                   */
sfb93       varchar2(1),             /*工艺否                                 */
                                     /*製程否                                 */
sfb94       varchar2(1),             /*FQC否                                  */
sfb95       varchar2(20),            /*特性代码                               */
sfb96       varchar2(255),           /*备注                                   */
sfb97       varchar2(20),            /*手册编号                               */
                                     /*手冊編號   (A050)                      */
sfb98       varchar2(10),            /*成本中心                               */
sfb99       varchar2(1),             /*返工否                                 */
                                     /*重工否(Y/N)                            */
sfb100      varchar2(1),             /*委外类型                               */
                                     /*委外型態                        養生計劃*/
                                     /*1.委外工單對委外採購單型態為一對一     */
                                     /*2.委外工單對委外採購單型態為一對多     */
                                     /*預設 '1'                               */
                                     /*兩者的差別在於,資料的一致性            */
sfb101      number(5),               /*变更序号                               */
                                     /*變更序號                        養生計劃*/
sfbacti     varchar2(1),             /*资料有效码                             */
                                     /*資料有效碼                             */
                                     /*系統維護                               */
sfbuser     varchar2(10),            /*资料所有者                             */
                                     /*資料所有者                             */
                                     /*系統維護                               */
sfbgrup     varchar2(10),            /*资料所有群                             */
                                     /*資料所有群                             */
                                     /*系統維護                               */
sfbmodu     varchar2(10),            /*资料更改者                             */
                                     /*資料更改者                             */
                                     /*系統維護                               */
sfbdate     date,                    /*最近更改日                             */
                                     /*最近修改日                             */
                                     /*系統維護                               */
sfb1001     varchar2(40),            /*保税核准文号                           */
sfb1002     varchar2(1),             /*保税核销否                             */
sfb1003     varchar2(20),            /*保税放行单号                           */
sfb102      varchar2(10),            /*生产线                                 */
sfb50       varchar2(4),             /*活动编号                               */
sfb51       varchar2(10),            /*理由码                                 */
sfb103      number(5),               /*工单工艺变更序号                       */
sfbud01     varchar2(255),           /*自订字段-Textedit                      */
sfbud02     varchar2(40),            /*原工单号                               */
sfbud03     varchar2(40),            /*期初开账否                             */
sfbud04     varchar2(40),            /*补料工单单号                           */
sfbud05     varchar2(40),            /*未结案原因                             */
sfbud06     varchar2(40),            /*自订字段-文字                          */
sfbud07     number(15,3),            /*PNL量                                  */
sfbud08     number(15,3),            /*原工单量                               */
sfbud09     number(15,3),            /*生产良率                               */
sfbud10     number(10),              /*排版数                                 */
sfbud11     number(10),              /*自动报工否1不自动 空值自动             */
sfbud12     number(10),              /*自订字段-整数                          */
sfbud13     varchar2(200),           /*自订字段-日期                          */
sfbud14     date,                    /*自订字段-日期                          */
sfbud15     date,                    /*自订字段-日期                          */
sfb43       varchar2(1),             /*签核状况                               */
sfb44       varchar2(10),            /*申请人                                 */
sfbmksg     varchar2(1),             /*是否签核                               */
sfbplant    varchar2(10) NOT NULL,   /*所属营运中心                           */
sfblegal    varchar2(10) NOT NULL,   /*所属法人                               */
sfboriu     varchar2(10),            /*资料建立者                             */
sfborig     varchar2(10),            /*资料建立部门                           */
sfb104      varchar2(1) DEFAULT ' ' NOT NULL, /*备置否(Y/N)*/
sfb919      varchar2(50),            /*计画批号                               */
sfb89       varchar2(20)             /*上阶工单单号                           */
);

create        index sfb_03 on sfb_file (sfb22,sfb221);
create        index sfb_02 on sfb_file (sfb05);
alter table sfb_file add  constraint sfb_pk primary key  (sfb01) enable validate;
grant select on sfb_file to tiptopgp;
grant update on sfb_file to tiptopgp;
grant delete on sfb_file to tiptopgp;
grant insert on sfb_file to tiptopgp;
grant index on sfb_file to public;
grant select on sfb_file to ods;
