/*
================================================================================
檔案代號:sfi_file
檔案名稱:工单历史档
檔案目的:
上游檔案:
下游檔案:
檔案類型:S
多語系檔案:N
============.========================.==========================================
*/
create table sfi_file
(
sfi01       varchar2(20) NOT NULL,   /*工单编号                               */
                                     /*工單編號                               */
sfi02       number(5),               /*工单类型                               */
                                     /*W/O Style                              */
                                     /*Store The W/O Style                    */
                                     /*Right Value 1/2/5/7/11/12              */
                                     /*1 : General W/O                        */
                                     /*2 : FAS W/O Allotment                  */
                                     /*5 : Rework W/O                         */
                                     /*7 : Subcontracting W/O                 */
                                     /*11: Disassembly W/O                    */
                                     /*12: Multi-Plant W/O                    */
sfi03       varchar2(24),            /*在制品会计科目                         */
                                     /*在製品會計科目                         */
sfi04       varchar2(1),             /*工单状态                               */
                                     /*工單狀態                               */
                                     /*儲存該工單目前處理階段狀況             */
                                     /*正確值 1/2/3/4/5/6/7/8                 */
                                     /*1: 確認生產工單(firm plan)             */
                                     /*2: 工單已發放,料表尚未列印             */
                                     /*3: 工單已發放,料表 已 列印             */
                                     /*4: 工單已發料                          */
                                     /*5: 在製過程中                          */
                                     /*6: 工單已完工,進入F.Q.C                */
                                     /*7: 完工入庫                            */
                                     /*8: 結案                                */
                                     /*D: 刪除                                */
sfi05       varchar2(40),            /*料件编号                               */
                                     /*料件編號                               */
                                     /*儲存該工單將投入生產料件               */
sfi06       varchar2(10),            /*使用工艺编号                           */
                                     /*使用製程編號     99/09/15              */
                                     /*儲存該工單將投入生產料件時所用的製程編 */
                                     /*號                                     */
sfi07       varchar2(10),            /*版本                                   */
                                     /*儲存工單投入生產的料件版本             */
sfi071      date,                    /*产品结构指定有效日期                   */
                                     /*產品結構指定有效日期                   */
                                     /*儲存工單投入生產的料件使用的產品結構指 */
                                     /*定有效日期                             */
sfi08       number(15,3) NOT NULL,   /*生产数量                               */
                                     /*生產數量                               */
                                     /*預計投入生產的數量，單位為料件生產單位 */
sfi081      number(15,3) NOT NULL,   /*已发料套数                             */
                                     /*已發料套數                             */
sfi09       number(15,3) NOT NULL,   /*完工已入库数量                         */
                                     /*完工已入庫數量                         */
                                     /*儲存該工單已完工入庫數量               */
sfi10       number(15,3) NOT NULL,   /*返工数量                               */
                                     /*再加工數量                             */
                                     /*儲存該工單再加工數量                   */
sfi11       number(15,3) NOT NULL,   /*F.Q.C 数量                             */
                                     /*F.Q.C 數量                             */
                                     /*儲存該工單在全檢（檢驗）數量           */
sfi111      number(15,3) NOT NULL,   /*MRB   数量                             */
                                     /*MRB   數量                             */
                                     /*儲存該工單在MRB的數量                  */
sfi12       number(15,3) NOT NULL,   /*报废数量                               */
                                     /*報廢數量                               */
                                     /*儲存該工單報廢數量                     */
sfi121      number(15,3),            /*在制盘盈亏量                           */
                                     /*在製盤盈虧量 add 99/09/15              */
sfi122      number(15,3),            /*No Use                                 */
sfi13       date,                    /*预计起始生产日期                       */
                                     /*預計起始生產日期(天)                   */
                                     /*儲存該工單預計投入生產日期             */
sfi14       varchar2(5),             /*预计起始生产时间                       */
                                     /*預計起始生產時間(時:分)                */
                                     /*儲存該工單預計投入生產時間             */
                                     /*量產系統專用                           */
sfi15       date,                    /*预计结束生产日期                       */
                                     /*預計結束生產日期(天)                   */
                                     /*儲存該工單預計完成生產日期             */
sfi16       varchar2(5),             /*预计结束生产时间                       */
                                     /*預計結束生產時間(時:分)                */
                                     /*儲存該工單預計完成生產時間             */
                                     /*量產系統專用                           */
sfi17       number(5),               /*已完工作业序号                         */
                                     /*已完工作業序號                         */
                                     /*儲存該工單目前已完工的最大作業序號     */
sfi18       date,                    /*最近一次作业完工日期                   */
                                     /*最近一次作業完工日期(天)               */
                                     /*儲存該工單 [已完工作業序號] 之完工日期 */
sfi19       varchar2(5),             /*最近一次作业完工时间                   */
                                     /*最近一次作業完工時間(時:分)            */
                                     /*儲存該工單 [已完工作業序號] 之完工時間 */
                                     /*量產系統專用                           */
sfi20       date,                    /*MPS/MRP 需求日期                       */
                                     /*MPS/MRP 需求日期(天)                   */
                                     /*儲存該工單之預計 MPS/MPR 需求日期      */
sfi21       varchar2(5),             /*MPS/MRP 需求时间                       */
                                     /*MPS/MRP 需求時間(時:分)                */
                                     /*儲存該工單之預計 MPS/MPR 需求時間      */
                                     /*量產系統專用                           */
sfi22       varchar2(20),            /*销单编号                               */
                                     /*銷單編號                               */
                                     /*儲存該工單之指定生產供給的銷單單號     */
                                     /*目前不用                               */
sfi221      number(5),               /*销单项次                               */
                                     /*銷單項次                               */
                                     /*儲存該工單之指定生產供給的銷單單號     */
                                     /*目前不用                               */
sfi222      varchar2(10),            /*No Use                                 */
sfi23       varchar2(1),             /*备料档生成                             */
                                     /*備料檔產生                             */
                                     /*儲存該工單是否已產生備料資料           */
                                     /*正確值 Y/N                             */
                                     /*Y: 該工單已產生備料資料                */
                                     /*N: 該工單尚未產生備料資料              */
sfi24       varchar2(1),             /*工艺追踪档生成                         */
                                     /*製程追蹤檔產生                         */
                                     /*儲存該工單是否已產生製程追蹤資料       */
                                     /*正確值 Y/N                             */
                                     /*Y: 該工單已產生製程追蹤資料            */
                                     /*N: 該工單尚未產生製程追蹤資料          */
sfi25       date,                    /*发料日期                               */
                                     /*發料日期                               */
                                     /*儲存該工單最近一次發料日期             */
sfi251      date,                    /*发放日期                               */
                                     /*發放日期                               */
                                     /*儲存該工單發放日期                     */
sfi26       varchar2(5),             /*发料时间                               */
                                     /*發料時間(時:分)                        */
                                     /*儲存該工單最近一次發料日期之時間       */
                                     /*量產系統專用                           */
sfi27       varchar2(10),            /*项目号码                               */
                                     /*專案號碼                               */
                                     /*儲存該工單所屬專案號碼                 */
sfi271      varchar2(30),            /*WBS编码                                */
                                     /*專案號碼-順序    010622 add No.B625    */
                                     /*儲存該工單所屬專案號碼-順序            */
sfi28       varchar2(1),             /*工单结案状态                           */
                                     /*工單結案狀態                           */
                                     /*正確值 1/2/3                           */
                                     /*1: 發料已結束,不能再發料               */
                                     /*2: 生產工時已結束,不能再發料及輸入工時 */
                                     /*3: 成本會計已結束,此工單不能再重新開啟 */
                                     /*   ，可轉入歷史檔                      */
sfi29       varchar2(1),             /*可用数量                               */
                                     /*可用數量                               */
                                     /*儲存執行主排程計劃或料需求計劃時，是否 */
                                     /*可考慮將該工單完工數量列入需求之供給   */
                                     /*正確值 Y/N                             */
                                     /*Y: 可考慮為供給                        */
                                     /*N: 不可考慮為供給                      */
sfi30       varchar2(10),            /*预计工单完工入库仓库                   */
                                     /*預計工單完工入庫倉庫別                 */
                                     /*儲存該工單完工後，預計存放的倉庫別     */
sfi31       varchar2(10),            /*预计工单完工入库库位                   */
                                     /*預計工單完工入庫儲位                   */
                                     /*儲存該工單完工後，預計存放的儲位       */
sfi32       varchar2(2),             /*起始排程方法                           */
                                     /*正確值 1/2/3/4/5                       */
                                     /*1: window scheduling forward           */
                                     /*2: window scheduling backward          */
                                     /*3: weighted window scheduling          */
                                     /*4: tracking scheduling forward         */
                                     /*5: tracking scheduling backward        */
sfi33       varchar2(2),             /*最近排程方法                           */
                                     /*正確值 1/2/3/4/5                       */
                                     /*1: window scheduling forward           */
                                     /*2: window scheduling backward          */
                                     /*3: weighted window scheduling          */
                                     /*4: tracking scheduling forward         */
                                     /*5: tracking scheduling backward        */
sfi34       number(9,4),             /*C/R 比率                               */
                                     /*C/R 比率(%)                            */
                                     /*儲存該工單緊急比率                     */
                                     /*開始時應設定為 '1'，可透過工單緊急比率 */
                                     /*重新計算作業重新設定                   */
                                     /*其值愈小者，賦予愈高的分派優先順序     */
sfi35       varchar2(1),             /*核算项                                 */
                                     /*異動碼(Y/N)                            */
                                     /*儲存該工單自上次料需求計劃後，如有變動 */
                                     /*時，則需在此備註                       */
                                     /*提供 nettable change MRP 使用          */
sfi36       date,                    /*工单发料结束日期                       */
                                     /*工單發料結束日期                       */
                                     /*按工單結案狀況，會有各階段結束日期；而 */
                                     /*本欄位記錄料帳結束日期，即在工單經過此 */
                                     /*階段後，系統即便不可再發料給該工單     */
                                     /*如需再發料，則需作工單的重新開啟作業， */
                                     /*才被允許可再發料給該工單               */
sfi37       date,                    /*工单发料及工时结束日                   */
                                     /*工單發料及工時結束日                   */
                                     /*按工單結案狀況，會有各階段結束日期；而 */
                                     /*本欄位記錄料帳及人工帳（工時）結束日期 */
                                     /*，簡而言之即在工單經過此階段後，系統即 */
                                     /*便不可再對該工單收集工時               */
                                     /*如需再收集工時，則需作工單的重新開啟作 */
                                     /*業，才被允許可再收集工時給該工單       */
sfi38       date,                    /*工单成本会计结束日期                   */
                                     /*工單成本會計結束日期                   */
                                     /*按工單結案狀況，會有各階段結束日期；而 */
                                     /*本欄位記錄該工單已在最後確定的階段日期 */
                                     /*，簡而言之即在工單經過此階段後，系統即 */
                                     /*便不可再對該工單發料及收集工時，而且亦 */
                                     /*無法再重新開啟                         */
sfi39       varchar2(1),             /*完工方式                               */
                                     /*儲存該工單在料帳上，使用撿料及發料系統 */
                                     /*或使用領料及事後扣帳系統               */
                                     /*正確值 1/2                             */
                                     /*1: 撿料及發料系統                      */
                                     /*   Picking List 與 Push       System   */
                                     /*2: 領料及事後扣帳系統                  */
                                     /*   Pull      List 與 Backflush System  */
sfi40       number(5),               /*优先顺序                               */
                                     /*優先順序                               */
                                     /*儲存該工單派工的優先順序               */
                                     /*正確值 應不小於零                      */
                                     /*其值愈小者順序愈高                     */
sfi41       varchar2(1),             /*冻结码                                 */
                                     /*凍結碼(frozen flag)                    */
                                     /*儲存該工單為需求之供給時，是否可更動其 */
                                     /*時程，以利需求之取得                   */
                                     /*正確值 Y/N                             */
                                     /*Y: 時程已被固定之工單                  */
                                     /*N: 時程尚未被固定之工單                */
sfi42       number(5),               /*工单展开阶数                           */
                                     /*工單展開階數                           */
                                     /*儲存該工單對下階自動產生工單的往下階數 */
sfi81       date,                    /*最近一次打印日期                       */
                                     /*最近一次列印日期                       */
                                     /*儲存工單料表最後一次列印日期           */
sfi82       varchar2(10),            /*制造部门                               */
                                     /*製造部門      alter 99/09/15           */
sfi85       varchar2(20),            /*料表批号 Picking Batch ID              */
                                     /*料表批號 Picking Batch ID              */
sfi86       varchar2(20),            /*来源工单号码                           */
                                     /*來源工單號碼                           */
sfi87       varchar2(1),             /*料表编号旗标                           */
                                     /*料表編號旗標                           */
sfi88       varchar2(20),            /*料表编号                               */
                                     /*料表編號                               */
sfi91       varchar2(20),            /*制造通知单                             */
                                     /*製造通知單                             */
sfi92       number(5),               /*项次                                   */
                                     /*項次                                   */
sfi93       varchar2(1),             /*工艺否                                 */
                                     /*製程否                                 */
sfi94       varchar2(1),             /*FQC否                                  */
sfi95       varchar2(1),             /*No Use                                 */
sfi96       varchar2(1),             /*No Use                                 */
sfi97       varchar2(1),             /*No Use                                 */
sfi98       varchar2(10),            /*成本中心                               */
sfi99       varchar2(1),             /*返工否(Y/N)                            */
                                     /*重工否(Y/N)                            */
sfiacti     varchar2(1),             /*资料有效码                             */
                                     /*資料有效碼                             */
                                     /*系統維護                               */
sfiuser     varchar2(10),            /*资料所有者                             */
                                     /*資料所有者                             */
                                     /*系統維護                               */
sfigrup     varchar2(10),            /*资料所有群                             */
                                     /*資料所有群                             */
                                     /*系統維護                               */
sfimodu     varchar2(10),            /*资料更改者                             */
                                     /*資料更改者                             */
                                     /*系統維護                               */
sfidate     date,                    /*最近更改日                             */
                                     /*最近修改日                             */
                                     /*系統維護                               */
sfi50       varchar2(4),             /*活动编号                               */
sfi51       varchar2(10),            /*理由码                                 */
sfiplant    varchar2(10) NOT NULL,   /*所属营运中心                           */
sfilegal    varchar2(10) NOT NULL,   /*所属法人                               */
sfiorig     varchar2(10),            /*资料建立部门                           */
sfioriu     varchar2(10)             /*资料建立者                             */
);

create        index sfi_02 on sfi_file (sfi05);
alter table sfi_file add  constraint sfi_pk primary key  (sfi01) enable validate;
grant select on sfi_file to tiptopgp;
grant update on sfi_file to tiptopgp;
grant delete on sfi_file to tiptopgp;
grant insert on sfi_file to tiptopgp;
grant index on sfi_file to public;
grant select on sfi_file to ods;
