/*
================================================================================
檔案代號:bmb_file
檔案名稱:产品结构元件明细资料档
檔案目的:
上游檔案:
下游檔案:
檔案類型:B
多語系檔案:N
============.========================.==========================================
*/
create table bmb_file
(
bmb01       varchar2(40) NOT NULL,   /*主件料件编号                           */
                                     /*主件料件編號                           */
                                     /*儲存該產品結構組合的主件料件編號。     */
                                     /*主件料件編號需在料件基本資料主檔中。   */
bmb02       number(5) NOT NULL,      /*组合项次                               */
                                     /*組合項次                               */
                                     /*儲存該產品結構組合的順序項次。         */
                                     /*可作為設定元件料件在該產品結構組合中的 */
                                     /*用料順序。                             */
bmb03       varchar2(40) NOT NULL,   /*元件料件编号                           */
                                     /*元件料件編號                           */
                                     /*儲存該產品結構組合的項次中使用的元件料 */
                                     /*件編號。                               */
                                     /*元件料件編號需在料件基本資料主檔中。   */
bmb04       date NOT NULL,           /*生效日期                               */
                                     /*儲存該產品結構組合的項次的有效期間之起 */
                                     /*始日期。                               */
bmb05       date,                    /*失效日期                               */
                                     /*儲存該產品結構組合的項次的無效期間之起 */
                                     /*始日期。                               */
                                     /*失效日期如為「null」表示最新的產品結構 */
                                     /*組合，目前將永久有效。                 */
bmb06       number(16,8),            /*组成用量                               */
                                     /*組成用量(QPA)                          */
                                     /*儲存該產品結構組合的項次中使用的元件料 */
                                     /*件在發料單位下的組合用量。             */
                                     /*正確值 需 大於「0」。                  */
                                     /*預設值 「1」。                         */
bmb07       number(16,8),            /*底数                                   */
                                     /*底數                                   */
                                     /*儲存該產品結構組合的項次中使用的元件料 */
                                     /*件在發料單位下的組合用量之基準主件量。 */
                                     /*正確值 需 大於「0」。                  */
                                     /*慣性值 「1」。                         */
                                     /*真正的用量=組成用量/底數。             */
bmb08       number(9,4),             /*损耗率                                 */
                                     /*損耗率                                 */
                                     /*儲存該產品結構組合的項次中使用的元件料 */
                                     /*件在組合時的預期損耗率。               */
                                     /*存放百分比值。                         */
                                     /*正確值 不小於「0」且不大於「100」之值。*/
bmb09       varchar2(6),             /*作业编号                               */
                                     /*作業編號                               */
                                     /*儲存該產品結構組合的項次對應主製程的投 */
                                     /*入之組合作業編號。                     */
                                     /*如值為「 」時，則表示未指定投入作業編號*/
bmb10       varchar2(4),             /*发料单位                               */
                                     /*發料單位                               */
                                     /*組合元件發料時使用單位                 */
bmb10_fac   number(20,8),            /*「发料」对「料件库存单位」             */
                                     /*「發料」對「料件庫存單位」換算率       */
bmb10_fac2  number(20,8),            /*「发料」对「料件成本单位」             */
                                     /*「發料」對「料件成本單位」換算率       */
bmb11       varchar2(20),            /*工程图号                               */
                                     /*工程圖號                               */
                                     /*儲存該產品結構組合的項次使用的工程圖號。*/
bmb13       varchar2(10),            /*元件插件位置                           */
                                     /*儲存該產品結構組合的項次使用的元件料件 */
                                     /*的插件位置。                           */
bmb14       varchar2(1),             /*元件使用特性                           */
                                     /*特性旗標為「Y」時，方才有效。          */
                                     /*正確值 「0/1」                         */
                                     /*0: required                            */
                                     /*1: optional                            */
bmb15       varchar2(1),             /*元件消耗特性                           */
                                     /*N: 不為消耗料件                        */
                                     /*Y: 為消耗料件                          */
bmb16       varchar2(1),             /*取/替代特性                            */
                                     /*0: 不可取替代                          */
                                     /*1: 新料,有舊料可取代(UTE)Use To Exhaust*/
                                     /*2: 主料,有副料可替代(SUB)              */
                                     /*5: 主料,可做SET替代    #Add By 養生2003*/
bmb17       varchar2(1),             /*特性旗标                               */
                                     /*特性旗標 (feature flag)                */
                                     /*正確值為 「Y/N」。                     */
                                     /*提供給特性產品結構組合使用，如為非特性 */
                                     /*產品結構組合時，其值固定為「N」。      */
                                     /*與 ima08='D' 同樣功能                  */
bmb18       number(5),               /*元件投料时距                           */
                                     /*元件投料時距                           */
                                     /*儲存該產品結構組合的項次使用的元件料件 */
                                     /*投料的前置時間。                       */
                                     /*可為負值, 表示生產幾天前就投料         */
bmb19       varchar2(1),             /*工单开立展开选项                       */
                                     /*工單開立展開選項                       */
                                     /*1.不展開                               */
                                     /*2.不展開,但自動開立工單                */
                                     /*3.展開                                 */
                                     /*4.開窗詢問是否展開                     */
bmb20       number(5),               /*No Use                                 */
bmb21       varchar2(1),             /*No Use                                 */
bmb22       varchar2(1),             /*No Use                                 */
bmb23       number(9,4),             /*选中率                                 */
                                     /*選中率                                 */
                                     /*儲存該產品結構組合的項次被選中的比率。 */
                                     /*特性旗標為「Y」時，方才有效。          */
bmb24       varchar2(20),            /*工程变异单单号                         */
                                     /*工程變異單單號 (ECN NO)                */
                                     /*記錄如經工程變異管理而產生或異動的產品 */
                                     /*結構組合之工程變異單據。               */
bmb25       varchar2(10),            /*仓库                                   */
                                     /*倉庫別                                 */
                                     /*生產時使用該元件所參考指定的倉庫別。   */
bmb26       varchar2(10),            /*存放位置                               */
                                     /*生產時使用該元件所參考指定的存放位置。 */
bmb27       varchar2(1),             /*元件是否软体对象                       */
                                     /*元件是否軟體物件                       */
                                     /*Y/N                                    */
bmb28       number(9,4),             /*发料误差允许率                         */
                                     /*發料誤差允許率       010515 # No.+114  */
bmbmodu     varchar2(10),            /*单身最近一次资料更改者                 */
                                     /*單身最近一次資料更改者                 */
                                     /*系統維護。                             */
bmbdate     date,                    /*单身最近一次更改日期                   */
                                     /*單身最近一次修改日期                   */
                                     /*系統維護。                             */
bmbcomm     varchar2(10),            /*更改指令来源                           */
                                     /*修改指令來源 (程式編號)                */
                                     /*系統維護。                             */
bmb29       varchar2(20) NOT NULL,   /*特性代码                               */
bmb30       varchar2(1),             /*计算方式                               */
bmb31       varchar2(1),             /*代买料否                               */
bmb33       number(10) DEFAULT '0' NOT NULL, /*款式BOM对应项次*/
bmbud01     varchar2(255),           /*备注                                   */
bmbud02     varchar2(40),            /*工艺发料编号                           */
bmbud03     varchar2(512),           /*位号                                   */
bmbud04     varchar2(40),            /*客户料号                               */
bmbud05     varchar2(40),            /*厂内名称                               */
bmbud06     varchar2(40),            /*排版                                   */
bmbud07     number(15,3),            /*自订字段-数值                          */
bmbud08     number(15,3),            /*自订字段-数值                          */
bmbud09     number(15,3),            /*自订字段-数值                          */
bmbud10     number(10),              /*自订字段-数值                          */
bmbud11     number(10),              /*自订字段-整数                          */
bmbud12     number(10),              /*自订字段-整数                          */
bmbud13     date,                    /*自订字段-日期                          */
bmbud14     date,                    /*自订字段-日期                          */
bmbud15     date,                    /*自订字段-日期                          */
bmb081      number(15,3),            /*固定损耗量                             */
bmb082      number(9,4),             /*损耗批量                               */
bmb36       varchar2(10),            /*PLM BOM项次                            */
bmb37       varchar2(40)             /*PLM KEY                                */
);

create        index bmb_02 on bmb_file (bmb03);
alter table bmb_file add  constraint bmb_pk primary key  (bmb01,bmb02,bmb03,bmb04,bmb29) enable validate;
grant select on bmb_file to tiptopgp;
grant update on bmb_file to tiptopgp;
grant delete on bmb_file to tiptopgp;
grant insert on bmb_file to tiptopgp;
grant index on bmb_file to public;
grant select on bmb_file to ods;
