/*
================================================================================
檔案代號:bmp_file
檔案名稱:产品结构元件明细资料档
檔案目的:
上游檔案:
下游檔案:
檔案類型:B
多語系檔案:N
============.========================.==========================================
*/
create table bmp_file
(
bmp01       varchar2(40) NOT NULL,   /*主件料件编号                           */
                                     /*主件料件編號                           */
                                     /*儲存該產品結構組合的主件料件編號。     */
                                     /*主件料件編號需在料件基本資料主檔中。   */
bmp011      varchar2(10) NOT NULL,   /*版本                                   */
                                     /*版本  add in 99/12/31                  */
bmp02       number(5) NOT NULL,      /*组合项次                               */
                                     /*組合項次                               */
                                     /*儲存該產品結構組合的順序項次。         */
                                     /*可作為設定元件料件在該產品結構組合中的 */
                                     /*用料順序。                             */
bmp03       varchar2(40) NOT NULL,   /*元件料件编号                           */
                                     /*元件料件編號                           */
                                     /*儲存該產品結構組合的項次中使用的元件料 */
                                     /*件編號。                               */
                                     /*元件料件編號需在料件基本資料主檔中。   */
bmp04       date NOT NULL,           /*生效日期                               */
bmp05       date,                    /*No Use                                 */
bmp06       number(16,8),            /*组成用量                               */
                                     /*組成用量(QPA)                          */
                                     /*儲存該產品結構組合的項次中使用的元件料 */
                                     /*件在發料單位下的組合用量。             */
                                     /*正確值 需 大於「0」。                  */
                                     /*預設值 「1」。                         */
bmp07       number(16,8),            /*底数                                   */
                                     /*底數                                   */
                                     /*儲存該產品結構組合的項次中使用的元件料 */
                                     /*件在發料單位下的組合用量之基準主件量。 */
                                     /*正確值 需 大於「0」。                  */
                                     /*慣性值 「1」。                         */
                                     /*真正的用量=組成用量/底數。             */
bmp08       number(9,4),             /*变动损耗率                             */
                                     /*损耗率                                 */
                                     /*储存该产品结构组合的项次中使用的元件料 */
                                     /*件在组合时的预期损耗率。               */
                                     /*存放百分比值。                         */
                                     /*正确值 不小於「0」且不大於「100」之值。*/
bmp09       varchar2(6),             /*作业编号                               */
                                     /*作業編號                               */
                                     /*儲存該產品結構組合的項次對應主製程的投 */
                                     /*入之組合作業編號。                     */
                                     /*如值為「 」時，則表示未指定投入作業編號*/
bmp10       varchar2(4),             /*发料单位                               */
                                     /*發料單位                               */
                                     /*組合元件發料時使用單位                 */
bmp10_fac   number(20,8),            /*「发料」对「料件库存单位」             */
                                     /*「發料」對「料件庫存單位」換算率       */
bmp10_fac2  number(20,8),            /*「发料」对「料件成本单位」             */
                                     /*「發料」對「料件成本單位」換算率       */
bmp11       varchar2(20),            /*工程图号                               */
                                     /*工程圖號                               */
                                     /*儲存該產品結構組合的項次使用的工程圖號。*/
bmp13       varchar2(10),            /*元件插件位置                           */
                                     /*儲存該產品結構組合的項次使用的元件料件 */
                                     /*的插件位置。                           */
bmp14       varchar2(1),             /*元件使用特性                           */
                                     /*特性旗標為「Y」時，方才有效。          */
                                     /*正確值 「0/1」                         */
                                     /*0: required                            */
                                     /*1: optional                            */
bmp15       varchar2(1),             /*元件消耗特性                           */
                                     /*儲存該產品結構組合的項次使用的元件料件 */
                                     /*是否為消耗性料件。                     */
                                     /*正確值 「N/Y」。                       */
                                     /*預設值 「N」。                         */
                                     /*N: 不為消耗料件                        */
                                     /*Y: 為消耗料件                          */
bmp16       varchar2(1),             /*取/替代特性                            */
                                     /*儲存該產品結構組合的項次使用的元件料件 */
                                     /*是否有取代或替代料件產品結構。         */
                                     /*正確值為「0/1/2」。                    */
                                     /*預設值為「0」。                        */
                                     /*0: normal                              */
                                     /*1: use to exhaust 取代                 */
                                     /*2: substitute     替代                 */
bmp17       varchar2(1),             /*特性旗标                               */
                                     /*特性旗標 (feature flag)                */
                                     /*正確值為 「Y/N」。                     */
                                     /*提供給特性產品結構組合使用，如為非特性 */
                                     /*產品結構組合時，其值固定為「N」。      */
bmp18       number(5),               /*元件投料时距                           */
                                     /*元件投料時距                           */
                                     /*儲存該產品結構組合的項次使用的元件料件 */
                                     /*投料的前置時間。                       */
                                     /*可為負值, 表示生產幾天後再投料         */
bmp19       varchar2(1),             /*工单开立展开选项                       */
                                     /*工單開立展開選項                       */
                                     /*1.不展開                               */
                                     /*2.不展開,但自動開立工單                */
                                     /*3.展開                                 */
bmp20       number(5),               /*销单打印用料清单时该元件排             */
                                     /*銷單列印用料清單時該元件排列順序       */
                                     /*提供在列印銷單時, 材料在用量清單上不同 */
                                     /*的排列方式                             */
bmp21       varchar2(1),             /*销单打印成本与否                       */
                                     /*銷單列印成本與否                       */
                                     /*在列印銷單上的材料用量清單時, 是否列印 */
                                     /*該元件所需成本                         */
bmp22       varchar2(1),             /*销单打印单价与否                       */
                                     /*銷單列印單價與否                       */
                                     /*在列印銷單上的材料用量清單時, 是否列印 */
                                     /*該元件所需單價                         */
bmp23       number(9,4),             /*选中率                                 */
                                     /*選中率                                 */
                                     /*儲存該產品結構組合的項次被選中的比率。 */
                                     /*特性旗標為「Y」時，方才有效。          */
bmp24       varchar2(20),            /*工程变异单单号                         */
                                     /*工程變異單單號 (ECN NO)                */
                                     /*記錄如經工程變異管理而產生或異動的產品 */
                                     /*結構組合之工程變異單據。               */
bmp25       varchar2(10),            /*仓库                                   */
                                     /*倉庫別                                 */
                                     /*生產時使用該元件所參考指定的倉庫別。   */
bmp26       varchar2(10),            /*存放位置                               */
                                     /*生產時使用該元件所參考指定的存放位置。 */
bmp27       varchar2(1),             /*元件是否软体对象                       */
                                     /*元件是否軟體物件                       */
bmpmodu     varchar2(10),            /*单身最近一次资料更改者                 */
                                     /*單身最近一次資料更改者                 */
                                     /*系統維護。                             */
bmpdate     date,                    /*单身最近一次更改日期                   */
                                     /*單身最近一次修改日期                   */
                                     /*系統維護。                             */
bmpcomm     varchar2(10),            /*更改指令来源                           */
                                     /*修改指令來源 (程式編號)                */
                                     /*系統維護。                             */
bmp28       varchar2(20) NOT NULL,   /*特性代码                               */
bmp29       varchar2(1),             /*计算方式                               */
bmpud01     varchar2(255),           /*自订字段-Textedit                      */
bmpud02     varchar2(40),            /*自订字段-文字                          */
bmpud03     varchar2(40),            /*自订字段-文字                          */
bmpud04     varchar2(40),            /*自订字段-文字                          */
bmpud05     varchar2(40),            /*自订字段-文字                          */
bmpud06     varchar2(40),            /*自订字段-文字                          */
bmpud07     number(15,3),            /*自订字段-数值                          */
bmpud08     number(15,3),            /*自订字段-数值                          */
bmpud09     number(15,3),            /*自订字段-数值                          */
bmpud10     number(10),              /*自订字段-整数                          */
bmpud11     number(10),              /*自订字段-整数                          */
bmpud12     number(10),              /*自订字段-整数                          */
bmpud13     date,                    /*自订字段-日期                          */
bmpud14     date,                    /*自订字段-日期                          */
bmpud15     date,                    /*自订字段-日期                          */
bmp081      number(15,3) DEFAULT '0' NOT NULL, /*固定损耗量*/
bmp082      number(9,4)              /*损耗批量                               */
);

create        index bmp_02 on bmp_file (bmp03);
alter table bmp_file add  constraint bmp_pk primary key  (bmp01,bmp011,bmp02,bmp03,bmp04,bmp28) enable validate;
grant select on bmp_file to tiptopgp;
grant update on bmp_file to tiptopgp;
grant delete on bmp_file to tiptopgp;
grant insert on bmp_file to tiptopgp;
grant index on bmp_file to public;
grant select on bmp_file to ods;
