/*
================================================================================
檔案代號:bmr_file
檔案名稱:设计变更申请资料档
檔案目的:
上游檔案:
下游檔案:
檔案類型:T
多語系檔案:N
============.========================.==========================================
*/
create table bmr_file
(
bmr01       varchar2(20) NOT NULL,   /*设计变更申请单单号                     */
                                     /*設計變更申請單單號                     */
bmr02       date,                    /*设计变更申请填单日期                   */
                                     /*設計變更申請填單日期                   */
bmr03       date,                    /*设计变更申请希望完成日期               */
                                     /*設計變更申請希望完成日期               */
bmr04       varchar2(10),            /*相关客户                               */
                                     /*相關客戶                               */
bmr05       varchar2(10),            /*申请部门                               */
                                     /*申請部門                               */
bmr06       varchar2(10),            /*申请人                                 */
                                     /*申請人                                 */
bmr07       varchar2(40),            /*料件编号                               */
                                     /*料件編號                               */
bmr08       varchar2(1),             /*属性-图面修正                          */
                                     /*屬性-圖面修正                          */
                                     /*正確值為「Y/N」。                      */
bmr09       varchar2(1),             /*属性-产品性能改正                      */
                                     /*屬性-產品性能改正                      */
                                     /*正確值為「Y/N」。                      */
bmr10       varchar2(1),             /*属性-制造困难                          */
                                     /*屬性-製造困難                          */
                                     /*正確值為「Y/N」。                      */
bmr11       varchar2(1),             /*属性-采购困难                          */
                                     /*屬性-採購困難                          */
                                     /*正確值為「Y/N」。                      */
bmr12       varchar2(1),             /*属性-降低制造成本                      */
                                     /*屬性-降低製造成本                      */
                                     /*正確值為「Y/N」。                      */
bmr13       varchar2(1),             /*属性-重新设计                          */
                                     /*屬性-重新設計                          */
                                     /*正確值為「Y/N」。                      */
bmr14       varchar2(1),             /*属性-应客户需求                        */
                                     /*屬性-應客戶需求                        */
                                     /*正確值為「Y/N」。                      */
bmr141      varchar2(10),            /*属性-相关文号                          */
                                     /*屬性-相關文號                          */
bmr15       varchar2(1),             /*属性-其它                              */
                                     /*屬性-其它                              */
                                     /*正確值為「Y/N」。                      */
bmr151      varchar2(80),            /*属性-其它之说明                        */
                                     /*屬性-其它之說明                        */
bmr16       varchar2(1),             /*建议处理方式-供应商库存                */
                                     /*建議處理方式-供應商庫存                */
                                     /*正確值為「A/B/C/D/E」。                */
                                     /*A: 報廢                                */
                                     /*B: 重修                                */
                                     /*C: 用完為止                            */
                                     /*D: 還給供應商                          */
                                     /*E: 用到ECN所指定之生效日或工令之後止   */
bmr17       number(20,6),            /*预估成本                               */
                                     /*預估成本（建議處理方式-供應商庫存）    */
bmr18       varchar2(1),             /*建议处理方式-零件库存                  */
                                     /*建議處理方式-零件庫存                  */
                                     /*正確值為「A/B/C/D/E」。                */
                                     /*A: 報廢                                */
                                     /*B: 重修                                */
                                     /*C: 用完為止                            */
                                     /*D: 還給供應商                          */
                                     /*E: 用到ECN所指定之生效日或工令之後止   */
bmr19       number(20,6),            /*预估成本                               */
                                     /*預估成本（建議處理方式-零件庫存）      */
bmr20       varchar2(1),             /*建议处理方式-在制品库存                */
                                     /*建議處理方式-在製品庫存                */
                                     /*A: 報廢                                */
                                     /*B: 重修                                */
                                     /*C: 用完為止                            */
                                     /*D: 還給供應商                          */
                                     /*E: 用到ECN所指定之生效日或工令之後止   */
bmr21       number(20,6),            /*预估成本                               */
                                     /*預估成本（建議處理方式-在製品庫存）    */
bmr22       varchar2(1),             /*建议处理方式-成品库存                  */
                                     /*建議處理方式-成品庫存                  */
                                     /*A: 報廢                                */
                                     /*B: 重修                                */
                                     /*C: 用完為止                            */
                                     /*D: 還給供應商                          */
                                     /*E: 用到ECN所指定之生效日或工令之後止   */
bmr23       number(20,6),            /*预估成本                               */
                                     /*預估成本（建議處理方式-成本庫存）      */
bmr24       varchar2(1),             /*建议处理方式-已出货成品                */
                                     /*建議處理方式-已出貨成品                */
                                     /*A: 報廢                                */
                                     /*B: 重修                                */
                                     /*C: 用完為止                            */
                                     /*D: 還給供應商                          */
                                     /*E: 用到ECN所指定之生效日或工令之後止   */
bmr25       number(20,6),            /*预估成本                               */
                                     /*預估成本（建議處理方式-已出貨成品）    */
bmr26       varchar2(1),             /*变更申请范围 一                        */
                                     /*變更申請範圍 一                        */
                                     /*包括庫存之零件、材料在製品、成品       */
                                     /*正確值為「Y/N」。                      */
bmr27       varchar2(1),             /*变更申请范围 二                        */
                                     /*變更申請範圍 二                        */
                                     /*包括已出貨之成品維修                   */
                                     /*正確值為「Y/N」。                      */
bmr30       varchar2(1),             /*变更后工程影响-制具                    */
                                     /*變更後工程影響-製具                    */
                                     /*正確值為「Y/N」。                      */
bmr31       varchar2(1),             /*变更后工程影响-测试方法,程             */
                                     /*變更後工程影響-測試方法,程序,程式      */
                                     /*正確值為「Y/N」。                      */
bmr32       varchar2(1),             /*变更后工程影响-工时                    */
                                     /*變更後工程影響-工時                    */
                                     /*正確值為「Y/N」。                      */
bmr33       varchar2(1),             /*变更后工程影响-制造                    */
                                     /*變更後工程影響-製造                    */
                                     /*正確值為「Y/N」。                      */
bmr34       varchar2(1),             /*变更后工程影响-其它                    */
                                     /*變更後工程影響-其它                    */
                                     /*正確值為「Y/N」。                      */
bmr35       varchar2(255),           /*变更后工程影响-其它说明                */
                                     /*變更後工程影響-其它說明                */
                                     /*正確值為「Y/N」。                      */
bmr36       varchar2(1),             /*变更后设计影响-Firmware                */
                                     /*變更後設計影響-Firmware                */
                                     /*正確值為「Y/N」。                      */
bmr37       varchar2(1),             /*变更后设计影响-Sckematic               */
                                     /*變更後設計影響-Sckematic               */
                                     /*正確值為「Y/N」。                      */
bmr38       varchar2(1),             /*变更后设计影响-PACKING                 */
                                     /*變更後設計影響-PACKING                 */
                                     /*正確值為「Y/N」。                      */
bmr39       varchar2(1),             /*变更后设计影响-QVL                     */
                                     /*變更後設計影響-QVL                     */
                                     /*正確值為「Y/N」。                      */
bmr40       varchar2(1),             /*变更后设计影响-UL.CSA.FCC.VDE          */
                                     /*變更後設計影響-UL.CSA.FCC.VDE          */
                                     /*正確值為「Y/N」。                      */
bmr41       varchar2(1),             /*变更后设计影响-S/W                     */
                                     /*變更後設計影響-S/W                     */
                                     /*正確值為「Y/N」。                      */
bmr42       varchar2(1),             /*变更后设计影响-BOM                     */
                                     /*變更後設計影響-BOM                     */
                                     /*正確值為「Y/N」。                      */
bmr43       varchar2(1),             /*变更后设计影响-PCB                     */
                                     /*變更後設計影響-PCB                     */
                                     /*正確值為「Y/N」。                      */
bmr44       varchar2(1),             /*变更后设计影响-产品规格                */
                                     /*變更後設計影響-產品規格                */
                                     /*正確值為「Y/N」。                      */
bmr45       varchar2(1),             /*变更后设计影响-其它                    */
                                     /*變更後設計影響-其它                    */
                                     /*正確值為「Y/N」。                      */
bmr46       varchar2(255),           /*变更后设计影响-其它之说明              */
                                     /*變更後設計影響-其它之說明              */
bmr47       varchar2(20),            /*工程变异单号                           */
                                     /*工程變異單號                           */
bmr48       varchar2(1),             /*是否签核                               */
                                     /*是否簽核                               */
bmr49       varchar2(1),             /*签核状态                               */
                                     /*簽核狀態                               */
                                     /*0: 開立(Open)           #No.6686       */
                                     /*1: 已核准                              */
                                     /*S: 送簽                                */
                                     /*R: 送簽退回                            */
                                     /*W: 抽單                                */
bmrsign     varchar2(4),             /*签核等级                               */
                                     /*簽核等級                               */
bmrdays     number(5),               /*签核完成天数                           */
                                     /*簽核完成天數                           */
bmrprit     number(5),               /*签核优先等级                           */
                                     /*簽核優先等級                           */
bmrsseq     number(5),               /*已签核顺序                             */
                                     /*已簽核順序                             */
bmrsmax     number(5),               /*应签核顺序                             */
                                     /*應簽核順序                             */
bmruser     varchar2(10),            /*资料所有者                             */
                                     /*資料所有者                             */
                                     /*系統維護。                             */
bmrgrup     varchar2(10),            /*资料所有群                             */
                                     /*資料所有群                             */
                                     /*系統維護。                             */
bmrmodu     varchar2(10),            /*资料更改者                             */
                                     /*資料更改者                             */
                                     /*系統維護。                             */
bmrdate     date,                    /*最近更改日                             */
                                     /*最近修改日                             */
                                     /*系統維護。                             */
bmracti     varchar2(1),             /*资料有效码                             */
                                     /*資料有效碼                             */
                                     /*系統維護。                             */
bmrplant    varchar2(10) NOT NULL,   /*所属营运中心                           */
bmrlegal    varchar2(10) NOT NULL,   /*所属法人                               */
bmroriu     varchar2(10),            /*资料建立者                             */
bmrorig     varchar2(10),            /*资料建立部门                           */
bmrconf     varchar2(1),             /*确认码                                 */
bmr50       varchar2(1)              /*BOM类别                                */
);

alter table bmr_file add  constraint bmr_pk primary key  (bmr01) enable validate;
grant select on bmr_file to tiptopgp;
grant update on bmr_file to tiptopgp;
grant delete on bmr_file to tiptopgp;
grant insert on bmr_file to tiptopgp;
grant index on bmr_file to public;
grant select on bmr_file to ods;
