/*
================================================================================
檔案代號:rpg_file
檔案名稱:时距编号档
檔案目的:
上游檔案:
下游檔案:
檔案類型:B
多語系檔案:N
============.========================.==========================================
*/
create table rpg_file
(
rpg01       varchar2(10) NOT NULL,   /*时距编号                               */
                                     /*時距代號                               */
rpg02       varchar2(80),            /*时距说明                               */
                                     /*時距說明                               */
rpg101      number(5),               /*第   1  期时距期别所含的日历           */
                                     /*第   1  期時距期別所含的日曆天數。     */
rpg102      number(5),               /*第   2  期时距期别所含的日历           */
                                     /*第   2  期時距期別所含的日曆天數。     */
rpg103      number(5),               /*第   3  期时距期别所含的日历           */
                                     /*第   3  期時距期別所含的日曆天數。     */
rpg104      number(5),               /*第   4  期时距期别所含的日历           */
                                     /*第   4  期時距期別所含的日曆天數。     */
rpg105      number(5),               /*第   5  期时距期别所含的日历           */
                                     /*第   5  期時距期別所含的日曆天數。     */
rpg106      number(5),               /*第   6  期时距期别所含的日历           */
                                     /*第   6  期時距期別所含的日曆天數。     */
rpg107      number(5),               /*第   7  期时距期别所含的日历           */
                                     /*第   7  期時距期別所含的日曆天數。     */
rpg108      number(5),               /*第   8  期时距期别所含的日历           */
                                     /*第   8  期時距期別所含的日曆天數。     */
rpg109      number(5),               /*第   9  期时距期别所含的日历           */
                                     /*第   9  期時距期別所含的日曆天數。     */
rpg110      number(5),               /*第   10  期时距期别所含的日历          */
                                     /*第  10  期時距期別所含的日曆天數。     */
rpg111      number(5),               /*第   11  期时距期别所含的日历          */
                                     /*第  11  期時距期別所含的日曆天數。     */
rpg112      number(5),               /*第   12  期时距期别所含的日历          */
                                     /*第  12  期時距期別所含的日曆天數。     */
rpg113      number(5),               /*第   13  期时距期别所含的日历          */
                                     /*第  13  期時距期別所含的日曆天數。     */
rpg114      number(5),               /*第   14  期时距期别所含的日历          */
                                     /*第  14  期時距期別所含的日曆天數。     */
rpg115      number(5),               /*第   15  期时距期别所含的日历          */
                                     /*第  15  期時距期別所含的日曆天數。     */
rpg116      number(5),               /*第   16  期时距期别所含的日历          */
                                     /*第  16  期時距期別所含的日曆天數。     */
rpg117      number(5),               /*第   17  期时距期别所含的日历          */
                                     /*第  17  期時距期別所含的日曆天數。     */
rpg118      number(5),               /*第   18  期时距期别所含的日历          */
                                     /*第  18  期時距期別所含的日曆天數。     */
rpg119      number(5),               /*第   19  期时距期别所含的日历          */
                                     /*第  19  期時距期別所含的日曆天數。     */
rpg120      number(5),               /*第   20  期时距期别所含的日历          */
                                     /*第  20  期時距期別所含的日曆天數。     */
rpg121      number(5),               /*第   21  期时距期别所含的日历          */
                                     /*第  21  期時距期別所含的日曆天數。     */
rpg122      number(5),               /*第   22  期时距期别所含的日历          */
                                     /*第  22  期時距期別所含的日曆天數。     */
rpg123      number(5),               /*第   23  期时距期别所含的日历          */
                                     /*第  23  期時距期別所含的日曆天數。     */
rpg124      number(5),               /*第   24  期时距期别所含的日历          */
                                     /*第  24  期時距期別所含的日曆天數。     */
rpg125      number(5),               /*第   25  期时距期别所含的日历          */
                                     /*第  25  期時距期別所含的日曆天數。     */
rpg126      number(5),               /*第   26  期时距期别所含的日历          */
                                     /*第  26  期時距期別所含的日曆天數。     */
rpg127      number(5),               /*第   27  期时距期别所含的日历          */
                                     /*第  27  期時距期別所含的日曆天數。     */
rpg128      number(5),               /*第   28  期时距期别所含的日历          */
                                     /*第  28  期時距期別所含的日曆天數。     */
rpg129      number(5),               /*第   29  期时距期别所含的日历          */
                                     /*第  29  期時距期別所含的日曆天數。     */
rpg130      number(5),               /*第   30  期时距期别所含的日历          */
                                     /*第  30  期時距期別所含的日曆天數。     */
rpg131      number(5),               /*第   31  期时距期别所含的日历          */
                                     /*第  31  期時距期別所含的日曆天數。     */
rpg132      number(5),               /*第   32  期时距期别所含的日历          */
                                     /*第  32  期時距期別所含的日曆天數。     */
rpg133      number(5),               /*第   33  期时距期别所含的日历          */
                                     /*第  33  期時距期別所含的日曆天數。     */
rpg134      number(5),               /*第   34  期时距期别所含的日历          */
                                     /*第  34  期時距期別所含的日曆天數。     */
rpg135      number(5),               /*第   35  期时距期别所含的日历          */
                                     /*第  35  期時距期別所含的日曆天數。     */
rpg136      number(5),               /*第   36  期时距期别所含的日历          */
                                     /*第  36  期時距期別所含的日曆天數。     */
rpg137      number(5),               /*总天数                                 */
                                     /*總天數                                 */
rpgacti     varchar2(1),             /*资料有效码                             */
rpguser     varchar2(10),            /*资料录入者                             */
rpggrup     varchar2(10),            /*资料所有群                             */
rpgmodu     varchar2(10),            /*资料更改者                             */
rpgdate     date,                    /*最近更改日                             */
rpgoriu     varchar2(10),            /*资料建立者                             */
rpgorig     varchar2(10)             /*资料建立部门                           */
);

alter table rpg_file add  constraint rpg_pk primary key  (rpg01) enable validate;
grant select on rpg_file to tiptopgp;
grant update on rpg_file to tiptopgp;
grant delete on rpg_file to tiptopgp;
grant insert on rpg_file to tiptopgp;
grant index on rpg_file to public;
grant select on rpg_file to ods;
