/*
================================================================================
檔案代號:smh_file
檔案名稱:成本中心档
檔案目的:
上游檔案:
下游檔案:
檔案類型:B
多語系檔案:N
============.========================.==========================================
*/
create table smh_file
(
smh01       varchar2(10) NOT NULL,   /*成本中心编号                           */
                                     /*成本中心編號                           */
smh02       varchar2(80),            /*成本中心说明                           */
                                     /*成本中心說明                           */
                                     /*----------------標    準----------------*/
smh103      number(13,5),            /*标准人工工资率                         */
                                     /*標準人工工資率                         */
smh104      varchar2(10),            /*标准工资率成本项目                     */
                                     /*標準工資率成本項目                     */
smh105      varchar2(1),             /*制造费用分担基准                       */
                                     /*製造費用分擔基準(1/2/3/4)              */
                                     /*正確值為 1/2/3/4                       */
                                     /*1. 直接人工成本                        */
                                     /*2. 直接人工小時                        */
                                     /*3. 直接材料成本                        */
                                     /*4. 生產數量                            */
smh106      number(13,5),            /*标准固定制造费用分摊率                 */
                                     /*標準固定製造費用分攤率                 */
smh107      varchar2(10),            /*标准固定制造费用成本项目               */
                                     /*標準固定製造費用成本項目               */
smh108      number(13,5),            /*标准变动制造费用分摊率                 */
                                     /*標準變動製造費用分攤率                 */
smh109      varchar2(10),            /*标准变动制造费用成本项目               */
                                     /*標準變動製造費用成本項目               */
                                     /*-----------------現    時---------------*/
smh203      number(13,5),            /*现时人工工资率                         */
                                     /*現時人工工資率                         */
smh204      varchar2(10),            /*现时工资率成本项目                     */
                                     /*現時工資率成本項目                     */
smh205      varchar2(1),             /*制造费用分担基准                       */
                                     /*製造費用分擔基準(1/2/3/4)              */
                                     /*正確值為 1/2/3/4                       */
                                     /*1. 直接人工成本                        */
                                     /*2. 直接人工小時                        */
                                     /*3. 直接材料成本                        */
                                     /*4. 生產數量                            */
smh206      number(13,5),            /*现时固定制造费用分摊率                 */
                                     /*現時固定製造費用分攤率                 */
smh207      varchar2(10),            /*现时固定制造费用成本项目               */
                                     /*現時固定製造費用成本項目               */
smh208      number(13,5),            /*现时变动制造费用分摊率                 */
                                     /*現時變動製造費用分攤率                 */
smh209      varchar2(10),            /*现时变动制造费用成本项目               */
                                     /*現時變動製造費用成本項目               */
                                     /*-----------------預    設---------------*/
smh303      number(13,5),            /*缺省人工工资率                         */
                                     /*預設人工工資率                         */
smh304      varchar2(10),            /*缺省工资率成本项目                     */
                                     /*預設工資率成本項目                     */
smh305      varchar2(1),             /*制造费用分担基准                       */
                                     /*製造費用分擔基準(1/2/3/4)              */
                                     /*正確值為 1/2/3/4                       */
                                     /*1. 直接人工成本                        */
                                     /*2. 直接人工小時                        */
                                     /*3. 直接材料成本                        */
                                     /*4. 生產數量                            */
smh306      number(13,5),            /*缺省固定制造费用分摊率                 */
                                     /*預設固定製造費用分攤率                 */
smh307      varchar2(10),            /*缺省固定制造费用成本项目               */
                                     /*預設固定製造費用成本項目               */
smh308      number(13,5),            /*缺省变动制造费用分摊率                 */
                                     /*預設變動製造費用分攤率                 */
smh309      varchar2(10),            /*缺省变动制造费用成本项目               */
                                     /*預設變動製造費用成本項目               */
smhacti     varchar2(1),             /*资料有效码                             */
                                     /*資料有效碼                             */
smhuser     varchar2(10),            /*资料所有者                             */
                                     /*資料所有者                             */
smhgrup     varchar2(10),            /*资料所有群                             */
                                     /*資料所有群                             */
smhmodu     varchar2(10),            /*资料更改者                             */
                                     /*資料更改者                             */
smhdate     date,                    /*最近更改日                             */
                                     /*最近修改日                             */
smhoriu     varchar2(10),            /*资料建立者                             */
smhorig     varchar2(10)             /*资料建立部门                           */
);

alter table smh_file add  constraint smh_pk primary key  (smh01) enable validate;
grant select on smh_file to tiptopgp;
grant update on smh_file to tiptopgp;
grant delete on smh_file to tiptopgp;
grant insert on smh_file to tiptopgp;
grant index on smh_file to public;
grant select on smh_file to ods;
