/*
================================================================================
檔案代號:ima_file
檔案名稱:料件资料主档
檔案目的:
上游檔案:
下游檔案:
檔案類型:M
多語系檔案:N
============.========================.==========================================
*/
create table ima_file
(
ima01       varchar2(40) NOT NULL,   /*料件编号                               */
                                     /*料件編號                               */
                                     /*料件存在系統中代表編號, 是唯一的       */
ima02       varchar2(120),           /*品名                                   */
                                     /*品名規格                               */
                                     /*描述該料件的品名規格, 如有需要進一步描 */
                                     /*述, 則可利用品名規格額外說明資料檔記錄 */
ima021      varchar2(120),           /*规格                                   */
                                     /*Specification                  (97/08/18*/
ima03       varchar2(40),            /*目录参考号码                           */
                                     /*目錄參考號碼                           */
                                     /*料件所屬的目錄編號                     */
                                     /*使用者可依目錄編號歸類管理列印         */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima04       varchar2(255),           /*工程图号                               */
                                     /*工程圖號                               */
                                     /*該料件所在的主要工程圖號               */
                                     /*可提供給生產/工程部門參考              */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima05       varchar2(10),            /*当前使用版本                           */
                                     /*目前使用版本                           */
                                     /*本料件目前使用的版本編號               */
                                     /*最近工程變異版本                       */
ima06       varchar2(10),            /*分群码                                 */
                                     /*分群碼                                 */
                                     /*0: 表由其他相關系統而來尚未分群        */
                                     /*當在料件基本資料建立時, 可利用分群碼來 */
                                     /*預設 相關欄位基本預設值                */
ima07       varchar2(1),             /*ABC码                                  */
                                     /*ABC 碼                                 */
                                     /*對料件庫存作價值特性分類管理, 將會影響 */
                                     /*料件的週期盤點策略.                    */
                                     /*可透過 ABC碼計算作業 依系統建議而得    */
                                     /*A類料件應為最高價值, B類料件應為次高價 */
                                     /*值, 而C類料件應為較低價值              */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima08       varchar2(1),             /*来源码                                 */
                                     /*來源碼                                 */
                                     /*說明料件屬性, 用以勾劃出不同歸屬特性的 */
                                     /*料件, 以便在料件庫存異動及物料需求 ..  */
                                     /*等作業時, 提供作業管制方式或限制       */
                                     /*正確值 C/T/D/A/M/P/X/K/U/V/R/Z/S       */
                                     /*預設值 依分群碼類別預設 或 空白, 且結果*/
                                     /*需有一種來源碼                         */
                                     /*C: 規格組件 (Configurable Product)     */
                                     /*T: 最後規格料件 (FAS Product)          */
                                     /*D: 特性料件 (Feature)                  */
                                     /*A: 族群料件 (Family Product)           */
                                     /*M: 自製料件 (Make Product)             */
                                     /*P: 採購料件 (Purchase)                 */
                                     /*X: 虛擬料件 (Phantom)                  */
                                     /*K: 配件虛擬料件 (Kit)                  */
                                     /*U: 自製大宗料件                        */
                                     /*V: 採購大宗料件                        */
                                     /*R: 在製途料件 (Routable)               */
                                     /*Z: 雜項料件 (Miscellaneous)            */
                                     /*S: 廠外加工料件 (Subcontract)          */
ima09       varchar2(10),            /*其他分群码 一                          */
                                     /*其他分群碼 一                          */
                                     /*提供給使用者, 對料件分群/分類除在分群  */
                                     /*碼中定義外, 可提供給其它的定義方式, 以 */
                                     /*供 管理/匯集報表 使用                  */
                                     /*將可分成 一/二/三/四 四個欄位以供交互  */
                                     /*定義使用                               */
                                     /*使用者可自行定義                       */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima10       varchar2(10),            /*其他分群码 二                          */
                                     /*其他分群碼 二                          */
                                     /*提供給使用者, 對料件分群/分類除在分群  */
                                     /*碼中定義外, 可提供給其它的定義方式, 以 */
                                     /*供 管理/匯集報表 使用                  */
                                     /*將可分成 一/二/三/四 四個欄位以供交互  */
                                     /*定義使用                               */
                                     /*使用者可自行定義                       */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima11       varchar2(10),            /*其他分群码 三                          */
                                     /*其他分群碼 三                          */
                                     /*提供給使用者, 對料件分群/分類除在分群  */
                                     /*碼中定義外, 可提供給其它的定義方式, 以 */
                                     /*供 管理/匯集報表 使用                  */
                                     /*將可分成 一/二/三/四 四個欄位以供交互  */
                                     /*定義使用                               */
                                     /*使用者可自行定義                       */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima12       varchar2(10),            /*其他分群码 四                          */
                                     /*成本分群碼                             */
ima13       varchar2(40),            /*规格组件料件编号                       */
                                     /*規格組件料件編號                       */
                                     /*如果料件來源碼為'T'(最後規格料件), 必  */
                                     /*須儲存其規格組件料件編號               */
                                     /*否則不可輸入, 應為空白                 */
                                     /*需存在料件資料主檔中, 且其料件來源碼需 */
                                     /*為'C'(規格組件)                        */
ima14       varchar2(1),             /*是否为工程料件                         */
                                     /*是否為工程料件                         */
                                     /*闡明該料件是否為工程料件, 以便分別管理 */
                                     /*工程料件及非工程料件                   */
                                     /*正確值 'Y' 或 'N'                      */
                                     /*Y: 工程料件                            */
                                     /*N: 非工程料件                          */
                                     /*預設值 依分群碼類別預設 或 'N'         */
ima15       varchar2(1),             /*保税与否                               */
                                     /*保稅與否                               */
                                     /*闡明該料件是否為保稅料件, 以便作 保稅  */
                                     /*處理作業                               */
                                     /*正確值 'Y' 或 'N'                      */
                                     /*Y: 保稅料件                            */
                                     /*N: 非保稅料件                          */
                                     /*預設值 依分群碼類別預設 或 'N'         */
ima16       number(5),               /*低阶码                                 */
                                     /*低階碼                                 */
                                     /*每一料件應皆有其低階碼, 如果為產品結構 */
                                     /*中的最上階, 其低階碼將被系統設定為 '0' */
                                     /*, 而非在產品結構中最上階者, 其階數將按 */
                                     /*其由最上階往下累計最大者為其低階碼; 其 */
                                     /*它無產品結構者, 其階數亦將被設定為 '0' */
                                     /*新增料件設定初始值為 '99', 日後可透過  */
                                     /*低階碼計算作業 而得其所在階數          */
                                     /*系統維護                               */
ima17       varchar2(4),             /*No Use                                 */
                                     /*NO USE                                 */
ima17_fac   number(16,8),            /*No Use                                 */
ima18       number(15,3),            /*单位重量                               */
                                     /*單位淨重 (Kg)                          */
ima19       varchar2(4),             /*保税料件进出口分类统计用类             */
                                     /*保稅料件進出口分類統計用類別           */
ima20       number(9,3),             /*保税料件年度盘差容许率                 */
                                     /*保稅料件年度盤差容許率                 */
ima21       varchar2(20),            /*保税料件税则编号                       */
                                     /*保稅料件稅則編號                       */
ima22       number(9,3),             /*保税料件应补税税率                     */
                                     /*保稅料件應補稅稅率                     */
ima23       varchar2(10),            /*仓管员                                 */
                                     /*倉管員                                 */
                                     /*該料件歸屬倉庫管理員                   */
                                     /*提供料件收/發料等, 庫存異動作業/單據管 */
                                     /*制, 列印依據                           */
                                     /*如果有設定倉管員, 則需存在 員工檔 內   */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima24       varchar2(1),             /*检验码                                 */
                                     /*檢驗否                                 */
ima25       varchar2(4),             /*库存单位                               */
                                     /*庫存單位                               */
                                     /*料件庫存數量計算單位, 在多單位管理系統 */
                                     /*下, 此庫位單位亦為系統換算基準單位     */
                                     /*預設值 依分群碼類別預設 或 空白        */
                                     /*必須輸入一單位, 且需存在 單位檔 內     */
                                     /*在以下各所有文件說明中, 稱之'料件庫存  */
                                     /*單位'                                  */
ima26       number(15,3),            /*No Use                                 */
                                     /*MPS/MRP 可用庫存數量(可用)             */
                                     /*儲存該料件可用的庫存數量, 使用料件庫存 */
                                     /*單位                                   */
                                     /*採用單一倉儲系統時, 此欄位值即為可用庫 */
                                     /*存明細數量, 其數量單位即為唯一的料件庫 */
                                     /*存單位, 可人為直接輸入                 */
                                     /*採用多倉儲系統時, 此欄位值即為所有可用 */
                                     /*庫存明細數量, 其庫存單位以料件庫存單位 */
                                     /*為基準下的可用庫存數量總和, 此欄位此時 */
                                     /*由將系統維護, 不提供人為修改           */
                                     /*新增時, 初始值設定為 '0'               */
                                     /*在以下各所有文件說明中, 稱之'料件庫存  */
                                     /*數量' 或 '可用料件庫存數量'            */
ima261      number(15,3),            /*No Use                                 */
                                     /*不可用庫存數量                         */
                                     /*儲存該料件不可用的庫存數量, 使用料件庫 */
                                     /*存單位                                 */
                                     /*採用單一倉儲系統時, 此欄位值即為不可用 */
                                     /*庫存明細數量, 其數量單位即為唯一的料件 */
                                     /*庫存單位, 可人為直接輸入               */
                                     /*採用多倉儲系統時, 此欄位值即為所有不可 */
                                     /*用庫存明細數量, 其庫存單位以料件庫存單 */
                                     /*位為基準下的不可用庫存數量總和, 此欄位 */
                                     /*此時將由系統維護, 不提供人為修改       */
                                     /*新增時, 初始值設定為 '0'               */
                                     /*在以下各所有文件說明中, 稱之'料件不可  */
                                     /*用料件庫存數量'                        */
ima262      number(15,3),            /*No Use                                 */
                                     /*庫存可用數量                           */
ima27       number(15,3),            /*安全库存量                             */
                                     /*安全庫存量                             */
                                     /*當在使用上, 希望在考量 MPS/MRP 產生計  */
                                     /*劃訂單(PLANNED ORDER)時, 在需求數量上  */
                                     /*能加上對庫存數量亦能維持一定的水準的庫 */
                                     /*存策略, 則可使用安全庫存量 或 安全庫存 */
                                     /*期間的作法                             */
                                     /*安全庫存量是以一固定數量來達成上述庫存 */
                                     /*策略                                   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima271      number(15,3),            /*最高储存数量                           */
                                     /*最高儲存數量                           */
ima28       number(15,3),            /*安全库存期间                           */
                                     /*安全庫存期間                           */
                                     /*當在使用上, 希望在考量 MPS/MPR 產生計  */
                                     /*劃訂單(PLANNED ORDER)時, 在需求數量上  */
                                     /*能加上對庫存數量亦能維持一定的水準的庫 */
                                     /*存策略, 則可使用安全庫存量 或 安全庫存 */
                                     /*期間的作法                             */
                                     /*安全庫存期間是以一日期間需求數量來達成 */
                                     /*上述庫存策略                           */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima29       date,                    /*最近异动日期                           */
                                     /*最近異動日期                           */
                                     /*該料件最近一次庫存異動日期, 可能為     */
                                     /*入庫/出庫/盤點日期                     */
                                     /*系統維護                               */
ima30       date,                    /*最近盘点日期                           */
                                     /*最近盤點日期                           */
                                     /*該料件最近一次庫存週期盤點日期         */
                                     /*系統維護                               */
ima31       varchar2(4),             /*销售单位                               */
                                     /*銷售單位                               */
                                     /*該料件的預設銷售單位, 而且在作銷售數量 */
                                     /*統計的作為基準單位                     */
                                     /*在以下各所有文件說明中, 稱之'料件銷售  */
                                     /*單位'                                  */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*如果不為可銷售料件則可不輸入; 假如, 輸 */
                                     /*入之單位不為料件庫存單位時, 必須有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(銷售*/
                                     /*單位/庫存單位換算率)                   */
ima31_fac   number(20,8),            /*销售单位/库存单位换算率                */
                                     /*Sales Unit/Inventory Unit Conversion RateConv. Rate Of Item Sales Unit VS Item Inventory UnitDefault Value  Default By Group Code : 0 Or Settiong Conv. Rate Between Units*/
ima32       number(20,6),            /*标准销售订价                           */
                                     /*標準售價                               */
ima33       number(20,6),            /*最近销售单价                           */
                                     /*最近售價                               */
ima34       varchar2(10),            /*成本中心                               */
                                     /*儲存該料件成本計算時, 所屬的成本中心   */
                                     /*當 製造管理系統參數 ASM #023 = 1 時,   */
                                     /*則可依需要去設定料件歸屬成本中心, 如此 */
                                     /*便可取得計算出該料件的人工成本及製造費 */
                                     /*用, 如果未設定則料件成本要素中, 除材料 */
                                     /*成本要素外, 其餘皆不動                 */
                                     /*當 製造管理系統參數 ASM #023 = 2 時,   */
                                     /*將使用 工作站及製程 來取得計算出該料件 */
                                     /*的人工成本及製造費用, 所以不需設定成本 */
                                     /*中心, 此時此欄位無用                   */
                                     /*當 製造管理系統參數 ASM #023 = 3 時,   */
                                     /*則可依需要去設定料件歸屬成本中心, 如此 */
                                     /*便可取得計算出該料件的人工成本及製造費 */
                                     /*用(由成本中心資料), 如果未設定則料件將 */
                                     /*使用 工作站及製程 來取得計算出該料件的 */
                                     /*人工成本及製造費用                     */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
                                     /*若有設定 成本中心 時, 則成本中心需存在 */
                                     /*成本中心主檔內                         */
ima35       varchar2(10),            /*主要仓库                               */
                                     /*主要倉庫別                             */
                                     /*儲存該料件存放的主要倉庫編號           */
                                     /*當採用單一倉儲系統時, 本欄位不輸入     */
                                     /*當採用多倉儲系統時, 本欄位可輸入, 或由 */
                                     /*系統維護 或不輸入, 但其倉庫編號需存在  */
                                     /*倉庫資料主檔內                         */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima36       varchar2(10),            /*主要库位别                             */
                                     /*主要儲位別                             */
                                     /*儲存該料件存放的主要倉庫別中的儲位     */
                                     /*當採用單一倉儲系統時, 本欄位不輸入     */
                                     /*當採用多倉儲系統時, 本欄位可輸入, 或由 */
                                     /*系統維護 或不輸入, 但其倉庫編號/儲位   */
                                     /*需存在倉庫/存放位置資料主檔內          */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima37       varchar2(1),             /*补货策略码                             */
                                     /*補貨策略碼                             */
                                     /*對該料件在執行 MPS/MPR 時的計劃訂單/訂 */
                                     /*單數量的建議產生策略                   */
                                     /*正確值 0/1/2/3/4/5                     */
                                     /*0: 再訂購點    Reorder point parts     */
                                     /*1: MPS         MPS parts               */
                                     /*2: MRP         MRP parts               */
                                     /*3: FAS         FAS parts               */
                                     /*4: 訂單式生產  On-order parts          */
                                     /*5: 期間採購    Fixed interval parts    */
                                     /*採用 再訂購點   時, 則會依庫存數量低於 */
                                     /*                    再補貨點數量時, 產 */
                                     /*                    生計劃訂單         */
                                     /*採用 MPS        時, 則會依主生產排程產 */
                                     /*                    生計劃訂單         */
                                     /*採用 MRP        時, 則會依物料需求計劃 */
                                     /*                    產生計劃訂單       */
                                     /*採用 FAS        時, 則會依主生產排程產 */
                                     /*                    生計劃訂單         */
                                     /*採用 訂單式生產 時, 則會依物料需求計劃 */
                                     /*                    產生計劃訂單, 而訂 */
                                     /*                    購數量以滿足客戶訂 */
                                     /*                    單需求即可         */
                                     /*                    目前未使用         */
                                     /*採用 期間採購   時, 則會固定的採購期間 */
                                     /*                    固定的採購數量來產 */
                                     /*                    生計劃訂單         */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
                                     /*必須有一正確值                         */
ima38       number(15,3),            /*再补货点                               */
                                     /*再補貨點                               */
                                     /*儲存當補貨策略採用再訂購點方式時的再補 */
                                     /*貨點水準數量                           */
                                     /*預設值 依分群碼類別預設 或 '0'         */
                                     /*其值為'0'時, 表示使用最小生產或採購數量*/
ima39       varchar2(24),            /*料件所属会计科目                       */
                                     /*料件所屬會計科目                       */
                                     /*儲存該料件成本會計所歸屬的會計科目     */
                                     /*輸入之檢查方式, 按製造管理系統參數來檢 */
                                     /*查合法與否                             */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima40       number(15,3),            /*累计使用数量  期间                     */
                                     /*累計使用數量  期間                     */
                                     /*儲存該料件目前期間/月份使用的累計數量  */
                                     /*祇有出庫時會修改此數量                 */
                                     /*系統維護                               */
ima41       number(15,3),            /*累计使用数量  年度                     */
                                     /*累計使用數量  年度                     */
                                     /*儲存該料件目前年度(含 目前期間累計數   */
                                     /*量)使用的累計數量                      */
                                     /*祇有出庫時會修改此數量                 */
                                     /*系統維護                               */
ima42       varchar2(1),             /*批号追踪方式                           */
                                     /*批號追蹤方式                           */
                                     /*正確值 0/1/2                           */
                                     /*0: 無                                  */
                                     /*1: 軟性                                */
                                     /*2: 硬性                                */
ima43       varchar2(100),           /*采购员                                 */
                                     /*採購員                                 */
                                     /*如該料件為採購性料件, 則儲存該料件歸屬 */
                                     /*的請/採購員代號                        */
                                     /*如果有設定採購員, 則需存在 員工檔 內   */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima44       varchar2(4),             /*采购单位                               */
                                     /*採購單位                               */
                                     /*該料件的預設採購單位, 而且在作採購數量 */
                                     /*統計的作為基準單位                     */
                                     /*在以下各所有文件說明中, 稱之'料件採購  */
                                     /*單位'                                  */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*如果不為可採購料件則可不輸入; 假如, 輸 */
                                     /*入之單位不為料件庫存單位時, 必須有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(採購*/
                                     /*單位/庫存單位換算率)                   */
ima44_fac   number(20,8),            /*采购单位/库存单位换算率                */
                                     /*採購單位/庫存單位換算率                */
                                     /*儲存該料件的料件採購單位對料件庫存單位 */
                                     /*的轉換率                               */
                                     /*預設值 依分群碼類別預設 或 '0' 或 單位 */
                                     /*間設定的轉換率                         */
ima45       number(15,3),            /*采购单位倍量                           */
                                     /*採購單位倍量                           */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 採購數量的稽核單位數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima46       number(15,3),            /*最少采购数量                           */
                                     /*最少採購數量                           */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 採購數量的最低水準數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima47       number(9,4),             /*采购损耗率                             */
                                     /*採購損耗率                             */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 交貨數量的可能發生損 */
                                     /*耗率, 為一百分比                       */
                                     /*計劃訂單數量需考慮此數量               */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima48       number(15,3),            /*采购安全期                             */
                                     /*交貨到前置時間                         */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件由採購單發出後至廠商生產交貨 */
                                     /*日期所需天數                           */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima49       number(15,3),            /*到厂前置期                             */
                                     /*到廠前置期                             */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 平均交貨到廠所需天數 */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima491      number(15,3),            /*入库前置期                             */
                                     /*入庫前置期                             */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 平均交貨到廠後檢驗所 */
                                     /*需天數                                 */
                                     /*預設值 依分群碼類別預設 或 '0'         */
                                     /*採購收貨入庫時自動計算                 */
ima50       number(15,3),            /*请购安全期                             */
                                     /*文件作業時間                           */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件由計劃需求到完成請購作業轉成 */
                                     /*採購單確認完成時, 所需天數             */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima51       number(15,3),            /*经济订购量                             */
                                     /*經濟訂購量                             */
ima52       number(15,3),            /*平均订购量                             */
                                     /*平均訂購量                             */
                                     /*儲存該料件的過去平均的訂購量           */
                                     /*預設值 依分群碼類別預設 或 '1'         */
                                     /*其值為'0'時, 即系統轉換為'1'           */
                                     /*由系統計算而來                         */
                                     /*將作為設定採購/生產倍量的參考依據      */
ima53       number(20,6),            /*最近采购单价                           */
                                     /*最近採購單價 (本幣)                    */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件最近一次發出採購的採購單價   */
                                     /*系統維護                               */
ima531      number(20,6),            /*市价                                   */
                                     /*市價 (本幣)                            */
ima532      date,                    /*市价最近更新日期                       */
                                     /*市價最近更新日期                       */
ima54       varchar2(10),            /*主要供应厂商                           */
                                     /*主要供應廠商                           */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件的主要供貨廠商編號           */
                                     /*如有設定, 需存在供應廠商資料主檔       */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima55       varchar2(4),             /*生产单位                               */
                                     /*生產單位                               */
                                     /*該料件的生產單位, 可與料件庫存單位不同 */
                                     /*在以下各所有文件說明中, 稱之'料件生產  */
                                     /*單位' 或 '生產單位'                    */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*如果不為可生產料件則可不輸入; 假如, 輸 */
                                     /*入之單位不為料件庫存單位時, 必須有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(生產*/
                                     /*單位/庫存單位換算率)                   */
ima55_fac   number(20,8),            /*生产单位/库存单位换算率                */
                                     /*生產單位/庫存單位換算率                */
                                     /*儲存該料件的料件生產單位對料件庫存單位 */
                                     /*的轉換率                               */
                                     /*預設值 依分群碼類別預設 或 '0' 或 單位 */
                                     /*間設定的轉換率                         */
ima56       number(15,3),            /*生产单位倍量                           */
                                     /*生產單位批量                           */
                                     /*如果該料件不為生產性料件時, 不需輸入   */
                                     /*儲存該料件生產時, 生產數量的稽核單位數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima561      number(15,3),            /*最少生产数量                           */
                                     /*最少生產數量                           */
                                     /*如果該料件不為生產性料件時, 不需輸入   */
                                     /*儲存該料件生產時, 生產數量的最低水準數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima562      number(9,4),             /*生产损耗率                             */
                                     /*生產損耗率                             */
                                     /*如果該料件不為生產性料件時, 不需輸入   */
                                     /*儲存該料件生產時, 製造數量的可能發生損 */
                                     /*耗率, 為一百分比                       */
                                     /*計劃訂單數量需考慮此數量               */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima57       number(5),               /*成本阶数                               */
                                     /*成本階數 (成會系統使用)                */
                                     /*char(02) -> smallint            No.7269*/
ima571      varchar2(40),            /*主工艺料件                             */
                                     /*製程料號                               */
                                     /*生管系統將以ima571與sfb06讀取製程資料  */
ima58       number(15,8),            /*最后人工工时                           */
                                     /*標準人工工時                           */
                                     /*儲存該料件的標準人工工時               */
                                     /*該料件需為使用成本中心資料計算成本時,  */
                                     /*才有用                                 */
                                     /*成本計算使用製程及工作站時, 則不需輸入 */
ima59       number(15,3),            /*固定前置时间                           */
                                     /*固定前置時間                           */
                                     /*此前置時間可由使用者自行輸入, 或由製程 */
                                     /*及工作站計算而來(以天為單位)           */
ima60       number(15,3),            /*变动前置时间                           */
                                     /*變動前置時間                           */
                                     /*此前置時間可由使用者自行輸入, 或由製程 */
                                     /*及工作站計算而來                       */
ima61       number(15,3),            /*QC 前置时间                            */
                                     /*QC 前置時間                            */
                                     /*此前置時間可由使用者自行輸入           */
ima62       number(15,3),            /*最大累计前置时间                       */
                                     /*最大累計前置時間                       */
                                     /*此前置時間可由使用者自行輸入, 或由製程 */
                                     /*及工作站計算而來                       */
ima63       varchar2(4),             /*发料单位                               */
                                     /*發料單位                               */
                                     /*該料件的預設發料單位, 而且在作發料數量 */
                                     /*統計的作為基準單位                     */
                                     /*在以下各所有文件說明中, 稱之'料件發料  */
                                     /*單位'                                  */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*輸入之單位不為料件庫存單位時, 需有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(發料*/
                                     /*單位/庫存單位換算率)                   */
ima63_fac   number(20,8),            /*发料单位/库存单位换算率                */
                                     /*發料單位/庫存單位換算率                */
                                     /*儲存該料件的料件發料單位對料件庫存單位 */
                                     /*的轉換率                               */
                                     /*預設值 依分群碼類別預設 或 '0' 或 單位 */
                                     /*間設定的轉換率                         */
ima64       number(15,3),            /*发料单位倍量                           */
                                     /*發料單位倍量                           */
                                     /*儲存該料件發料時, 發末數量的稽核單位數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*量產製造系統使用                       */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima641      number(15,3),            /*最少发料数量                           */
                                     /*最少發料數量                           */
                                     /*儲存該料件發料時, 發料數量的稽核單位數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*量產製造系統使用                       */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima65       number(15,3),            /*发料安全存量                           */
                                     /*發料安全存量                           */
                                     /*儲存該料件發料時, 發料數量的稽核應保留 */
                                     /*的安全水準數量                         */
                                     /*量產製造系統使用                       */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima66       number(15,3),            /*发料安全期                             */
                                     /*發料安全期                             */
                                     /*儲存該料件發料時應在多少天前被發到工作 */
                                     /*區                                     */
                                     /*量產製造系統使用                       */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima67       varchar2(10),            /*计划员                                 */
                                     /*計劃員                                 */
                                     /*如該料件為生產性料件, 則儲存該料件歸屬 */
                                     /*的計劃員代號                           */
                                     /*如果有設定計劃員, 則需存在 員工檔 內   */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima68       number(15,3),            /*需求时距                               */
                                     /*需求時距                               */
                                     /*儲存該料件在作主生產排程時, 在此時距點 */
                                     /*之後, 才可考慮預測需求                 */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima69       number(15,3),            /*计划时距                               */
                                     /*計劃時距                               */
                                     /*儲存該料件在作主生產排程時, 在此時距點 */
                                     /*之後, 才可產生計劃訂單                 */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima70       varchar2(1),             /*消耗料件                               */
                                     /*消秏料件                               */
                                     /*正確值 Y/N                             */
                                     /*Y: 消秏料件    (採用領料系統)          */
                                     /*N: 非消秏料件  (採用發料系統)          */
                                     /*預設值 依分群碼類別預設 或 'N'         */
ima71       number(5),               /*储存有效天数                           */
                                     /*儲存有效天數                           */
                                     /*儲存該料件入庫上架後, 有效的存放天數,  */
                                     /*將作為發料使用的優先順序               */
                                     /*如為 '0', 則表示不作此類管制庫存方式   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima72       number(15,3),            /*MRP允许交期提前天数                    */
                                     /*MRP 允許交期提前調整天數               */
ima73       date,                    /*最近入库日                             */
                                     /*最近入庫日                             */
                                     /*該料件最近一次庫存收貨日期             */
                                     /*系統維護                               */
ima74       date,                    /*最近出库日                             */
                                     /*最近出庫日                             */
                                     /*該料件最近一次庫存發貨日期             */
                                     /*系統維護                               */
ima86       varchar2(4),             /*成本单位                               */
                                     /*成本單位                               */
                                     /*在以下各所有文件說明中, 稱之'料件成本  */
                                     /*單位'                                  */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*輸入之單位不為料件庫存單位時, 需有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(成本*/
                                     /*單位/庫存單位換算率)                   */
ima86_fac   number(20,8),            /*成本/库存单位换算率                    */
                                     /*成本/庫存單位換算率                    */
                                     /*儲存該料件的料件成本單位對料件庫存單位 */
                                     /*的轉換率                               */
                                     /*預設值 依分群碼類別預設 或 '0' 或 單位 */
                                     /*間設定的轉換率                         */
ima87       varchar2(10),            /*成本项目--材料                         */
                                     /*成本項目--材料                         */
                                     /*儲存該料件的材料成本所歸屬的成本結構項目*/
                                     /*需存在 成本項目主檔 內                 */
                                     /*若製造管理系統參數 ASM #058 = "Y"(使用 */
                                     /*成本項目結構)時, 才可輸入              */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima871      number(9,4),             /*间接物料分摊率                         */
                                     /*間接物料分攤率                         */
                                     /*儲存該料件的間接物料成本分攤率         */
                                     /*分攤率, 不為百分比是一因子             */
                                     /*使用此種分攤率作法上, 常設定為         */
                                     /*    一. 成本逆算上, 不包含大宗料件     */
                                     /*    二. 不採用附加成本方式             */
                                     /*    三. 成會間接物料成本計算時使用之   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima872      varchar2(10),            /*材料制造费用成本项目                   */
                                     /*材料製造費用成本項目                   */
                                     /*儲存該料件的間接物料成本所歸屬的成本結 */
                                     /*構項目                                 */
                                     /*需存在 成本項目主檔 內                 */
                                     /*若製造管理系統參數 ASM #058 = "Y"(使用 */
                                     /*成本項目結構)時, 才可輸入且分攤率不應  */
                                     /*為 '0'時                               */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima873      number(9,4),             /*间接人工分摊率                         */
                                     /*間接人工分攤率                         */
                                     /*儲存該料件的間接人工成本分攤率         */
                                     /*分攤率, 不為百分比是一因子             */
                                     /*使用此種分攤率作法上, 常設定為         */
                                     /*    一. 成本逆算上, 不包含大宗料件     */
                                     /*    二. 不採用附加成本方式             */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima874      varchar2(10),            /*人工制造费用成本项目                   */
                                     /*人工製造費用成本項目                   */
                                     /*儲存該料件的間接人工成本所歸屬的成本結 */
                                     /*構項目                                 */
                                     /*需存在 成本項目主檔 內                 */
                                     /*若製造管理系統參數 ASM #058 = "Y"(使用 */
                                     /*成本項目結構)時, 才可輸入且分攤率不應  */
                                     /*為 '0'時                               */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima88       number(15,3),            /*期间采购数量                           */
                                     /*期間採購數量                           */
                                     /*儲存該料件的期間固定採購數量           */
                                     /*數量單位為料件庫存單位                 */
                                     /*該料件的補貨策略為期間採購, 才可輸入此 */
                                     /*欄位值, 且一定需輸入                   */
                                     /*預設值 依分群碼類別預設 或 '1'         */
ima881      date,                    /*期间采购最近采购日期                   */
                                     /*期間採購最近採購日期                   */
                                     /*儲存該料件的固定期間採購, 最近一次採購 */
                                     /*日期                                   */
                                     /*作為下次採購的基準日期                 */
                                     /*該料件的補貨策略為期間採購, 才會有儲存 */
                                     /*此欄位日期                             */
                                     /*系統維護                               */
ima89       number(5),               /*期间采购使用的期间                     */
                                     /*期間採購使用的期間(月)                 */
                                     /*儲存該料件的固定期間數/月數            */
                                     /*如下一欄位亦有值時, 固定期間採用本欄   */
                                     /*該料件的補貨策略為期間採購, 才可輸入此 */
                                     /*欄位值, 且一定需與下一欄位作選擇輸入   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima90       number(5),               /*期间采购使用的期间                     */
                                     /*期間採購使用的期間(日)                 */
                                     /*儲存該料件的固定期間數/天數            */
                                     /*如上一欄位亦有值時, 固定期間採用上一欄 */
                                     /*該料件的補貨策略為期間採購, 才可輸入此 */
                                     /*欄位值, 且一定需與上一欄位作選擇輸入   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima91       number(20,6),            /*平均采购单价                           */
                                     /*平均採購單價 (本幣)(移動加權平均)      */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件加權平均的採購單價           */
                                     /*採購單發出時, 計算之                   */
                                     /*系統維護                               */
ima92       varchar2(1),             /*NET CHANGE  flag                       */
                                     /*net change flag                        */
                                     /*儲存該料件其產品結構或工單或採購單有異 */
                                     /*動時, 則狀況旗標改為 "Y"               */
                                     /*提供給 MPS/MRP 執行 NET CHANGE 時, 使用*/
                                     /*且會還原為 "N"                         */
                                     /*系統維護                               */
ima93       varchar2(8),             /*新料件处理状况                         */
                                     /*new parts status                       */
                                     /*儲存該料件新增後, 設定處理狀況旗標     */
                                     /*系統會自動提示應該被執行的料件資料維護 */
                                     /*作業, 以利使用者作業                   */
                                     /*第一碼 ='Y' 表示有新增修改庫存資料     */
                                     /*第二碼 ='Y' 表示有新增修改銷售資料     */
                                     /*第三碼 ='Y' 表示有新增修改採購資料     */
                                     /*第四碼 ='Y' 表示有新增修改生管資料     */
                                     /*第五碼 ='Y' 表示有新增修改成本資料     */
                                     /*第六碼 ='Y' 表示有新增修改成本要素值資料*/
                                     /*第七碼 ='Y' 表示有新增修改成本項目結構 */
                                     /*第八碼 ='Y' 表示有新增修改品名規格說明 */
                                     /*系統維護                               */
ima94       varchar2(10),            /*缺省工艺编号                           */
                                     /*預設製程編號 (工單開立時預設之)        */
ima95       number(20,6),            /*保税单价                               */
                                     /*保稅單價                               */
ima75       varchar2(15),            /*No Use                                 */
ima76       varchar2(10),            /*No Use                                 */
ima77       number(16,8),            /*No Use                                 */
ima78       number(5),               /*预算成本阶数                           */
                                     /*預算成本階數                02/10/11modi*/
ima79       number(5),               /*No Use                                 */
ima80       number(5),               /*发料低阶码                             */
ima81       number(5),               /*No Use                                 */
ima82       number(5),               /*No Use                                 */
ima83       number(5),               /*No Use                                 */
ima84       number(5),               /*No Use                                 */
ima85       number(5),               /*No Use                                 */
ima851      varchar2(10),            /*缺省工作区                             */
                                     /*預設工作區                             */
                                     /*需存在預擬工作區檔中                   */
ima852      varchar2(1),             /*是否为量产料件                         */
                                     /*是否為量產料件                         */
                                     /*正確值為 Y/N                           */
ima853      varchar2(1),             /*检查该料件是否已卷算过                 */
                                     /*檢查該料件是否已捲算過                 */
                                     /*正確值為 Y/N                           */
ima96       number(5),               /*No Use                                 */
ima97       number(5),               /*No Use                                 */
ima98       number(20,6),            /*月加权平均售价                         */
ima99       number(15,3),            /*再补货量                               */
ima100      varchar2(1),             /*检验程度                               */
ima101      varchar2(1),             /*检验水准                               */
                                     /*檢驗水準                               */
                                     /*1.一般    2.特殊                       */
ima102      varchar2(1),             /*级数                                   */
                                     /*級數                                   */
ima103      varchar2(1),             /*采购特性                               */
                                     /*採購特性                               */
                                     /*分類此採購料件特性                     */
                                     /*'0':內購 '1':外購 '2':其它             */
ima104      number(15,3),            /*厂商分配限量                           */
                                     /*廠商分配限量                           */
ima105      varchar2(1),             /*是否为软体对象                         */
                                     /*是否為軟體物件                         */
ima106      varchar2(1),             /*保税料件类型                           */
                                     /*保稅料件型態 (1.原料 2.半成品 3.成品)  */
ima107      varchar2(1),             /*插件位置                               */
                                     /*插件位置   #No:6542                    */
                                     /*Y:  自動開窗輸入插件位置               */
                                     /*N:不自動開窗輸入插件位置               */
ima108      varchar2(1),             /*工单发料前调拨否                       */
                                     /*工單發料前調撥否(Y/N)                  */
                                     /*  Y:工單發料前須先依批量及最小發料量,針*/
                                     /*    對WIP倉庫存不足量, 以調撥方式調撥至*/
                                     /*    WIP倉(線上倉)補充之                */
                                     /*    但工單備料/發料時則不考慮發料倍量  */
                                     /*  N/Null:不調自動調撥(Default)         */
                                     /*SMT料判斷此欄位 Y:發SMT料 N:非SMT料    */
ima109      varchar2(10),            /*材料类型                               */
                                     /*材料類別                               */
ima110      varchar2(1),             /*工单开立展开选项                       */
                                     /*工單開立展開選項                       */
                                     /*1.不展開                               */
                                     /*2.不展開, 但自動開立工單               */
                                     /*3.展開                                 */
                                     /*4.開窗詢問是否展開                     */
ima111      varchar2(5),             /*缺省工单单别                           */
                                     /*預設工單單別                           */
ima121      number(20,6),            /*单位材料成本                           */
                                     /*單位材料成本                           */
ima122      number(20,6),            /*单位人工成本                           */
                                     /*單位人工成本                           */
ima123      number(20,6),            /*单位制造费用                           */
                                     /*單位製造費用                           */
ima124      number(20,6),            /*单位管销成本                           */
                                     /*單位管銷成本                           */
ima125      number(20,6),            /*单位成本                               */
                                     /*單位成本 (=料+工+費+管)                */
ima126      number(15,3),            /*基本利润率                             */
                                     /*基本利潤率                             */
ima127      number(20,6),            /*税前订价                               */
                                     /*未稅訂價(本幣)                         */
ima128      number(20,6),            /*含税订价                               */
                                     /*含稅訂價(本幣)                         */
ima129      number(15,3),            /*调拨计价加计百分比                     */
                                     /*轉撥計價加計百分比                     */
ima130      varchar2(1),             /*产品销售特性                           */
                                     /*產品銷售特性                           */
                                     /*  0.非產品, 不可銷售                   */
                                     /*  1.一般產品, 可直接銷售               */
                                     /*  2.PHASE OUT,<^P>查詢不顯示,仍可銷售  */
ima131      varchar2(10),            /*产品分类编号                           */
                                     /*產品分類編號                           */
ima132      varchar2(24),            /*费用科目编号                           */
                                     /*費用科目編號                           */
ima133      varchar2(40),            /*产品预测料号                           */
                                     /*產品預測料號                           */
ima134      varchar2(15),            /*主要包装方式编号                       */
                                     /*主要包裝方式編號                       */
ima135      varchar2(40),            /*产品条码编号                           */
                                     /*產品條碼編號                           */
ima136      varchar2(10),            /*主要WIP 仓库                           */
                                     /*主要WIP 倉庫                           */
ima137      varchar2(10),            /*主要WIP 库位                           */
                                     /*主要WIP 儲位                           */
ima138      varchar2(40),            /*FCC No.                                */
ima139      varchar2(1),             /*MPS 计算否                             */
                                     /*MPS 計算否                             */
ima140      varchar2(1),             /*Phase Out 否                           */
ima141      varchar2(1),             /*产品序号控制方式                       */
                                     /*產品序號(Serial No)控制方式            */
                                     /*0.不處理                               */
                                     /*1.本產品使用同一產品序號               */
                                     /*2.每次出貨均賦予產品序號               */
ima142      number(5),               /*产品序号之固定长度                     */
                                     /*產品序號之固定長度                     */
ima143      number(5),               /*产品序号之字首固定长度                 */
                                     /*產品序號之字首固定長度                 */
ima144      varchar2(10),            /*产品序号之字首固定字                   */
                                     /*產品序號之字首固定字                   */
ima145      varchar2(1),             /*产品序号是否为固定长度                 */
                                     /*產品序號是否為固定長度                 */
ima146      varchar2(1),             /*BOM异动否                              */
                                     /*Y.當BOM有異動時                        */
                                     /*0.當BOM有異動時,且該料為level=0 的主件 */
                                     /*Low level code 重計時更新為 NULL       */
ima147      varchar2(1),             /*插件位置与QPA是否要勾稽                */
                                     /*插件位置與QPA是否要勾稽 #NO:6542       */
ima148      number(5),               /*保证期                                 */
                                     /*保證期(天)              #NO:7181(養生) */
ima901      date,                    /*料件建档日期                           */
                                     /*料件建檔日期           (96/07/09)      */
ima902      date,                    /*呆滞日期                               */
                                     /*呆滯日期                               */
ima903      varchar2(1),             /*可否做联产品入库                       */
                                     /*可否做聯產品入庫#NO:6872               */
ima904      varchar2(1),             /*用户自行定义                           */
                                     /*使用者自行定義                         */
ima905      varchar2(1),             /*当月是否入联产品                       */
                                     /*當月是否入聯產品#NO:6872               */
ima906      varchar2(1),             /*单位使用方式                           */
                                     /*使用者自行定義                         */
ima907      varchar2(4),             /*第二单位(母单位/参考单位)              */
                                     /*使用者自行定義                         */
ima908      varchar2(4),             /*计价单位                               */
                                     /*使用者自行定義                         */
ima909      number(5),               /*MRP汇总时距(天)(预留字段)              */
                                     /*使用者自行定義                         */
ima910      varchar2(20) DEFAULT ' ' NOT NULL, /*主特性代码*/
                                     /*使用者自行定義                         */
imaacti     varchar2(1),             /*资料有效码                             */
                                     /*資料有效碼                             */
                                     /*系統維護                               */
imauser     varchar2(10),            /*资料所有者                             */
                                     /*資料所有者                             */
                                     /*系統維護                               */
imagrup     varchar2(10),            /*资料所有群                             */
                                     /*資料所有群                             */
                                     /*系統維護                               */
imamodu     varchar2(10),            /*资料更改者                             */
                                     /*資料更改者                             */
                                     /*系統維護                               */
imadate     date,                    /*最近更改日                             */
                                     /*最近修改日                             */
                                     /*系統維護                               */
imaag       varchar2(10),            /*属性群组代码                           */
imaag1      varchar2(10),            /*母料件属性群组代码                     */
imaud01     varchar2(255),           /*自订字段                               */
imaud02     varchar2(40),            /*包装单位                               */
imaud03     varchar2(40),            /*检测期间                               */
imaud04     varchar2(40),            /*有害物质否                             */
imaud05     varchar2(40),            /*生产厂商                               */
imaud06     varchar2(255),           /*产品类型                               */
imaud07     varchar2(50),            /*料件面积                               */
imaud08     number(15,3),            /*包装量                                 */
imaud09     varchar2(100),           /*标准良率                               */
imaud10     number(10),              /*排版数                                 */
imaud11     number(10),              /*自订字段                               */
imaud12     number(10),              /*自订字段                               */
imaud13     date,                    /*自订字段                               */
imaud14     date,                    /*自订字段                               */
imaud15     date,                    /*自订字段                               */
ima1001     varchar2(100),           /*中文名称(全称)                         */
ima1002     varchar2(80),            /*英文名称                               */
ima1003     varchar2(20),            /*No Use                                 */
ima1004     varchar2(10),            /*品类                                   */
ima1005     varchar2(10),            /*品牌                                   */
ima1006     varchar2(10),            /*系列                                   */
ima1007     varchar2(10),            /*型别                                   */
ima1008     varchar2(10),            /*规格                                   */
ima1009     varchar2(10),            /*特性分群码四                           */
ima1010     varchar2(1),             /*状态码                                 */
ima1011     number(15,3),            /*单位体积                               */
ima1012     date,                    /*首次出货日                             */
ima1013     date,                    /*首次入库日                             */
ima1014     varchar2(1),             /*产品周期状态                           */
ima1015     date,                    /*NoUse                                  */
ima1016     varchar2(40),            /*箱条码                                 */
ima1017     number(20,6),            /*料件标准宽                             */
ima1018     number(20,6),            /*料件标准秤量                           */
ima1019     number(20,6),            /*零只长度                               */
ima1020     number(20,6),            /*零只宽度                               */
ima1021     number(20,6),            /*零只高度                               */
ima1022     number(15,3),            /*零只体积                               */
ima1023     number(15,3),            /*零只重量                               */
ima1024     number(20,6),            /*整箱长度                               */
ima1025     number(20,6),            /*整箱宽度                               */
ima1026     number(20,6),            /*整箱高度                               */
ima1027     number(15,3),            /*整箱体积                               */
ima1028     number(15,3),            /*整箱重量                               */
ima1029     varchar2(1),             /*是否秤重控管                           */
ima911      varchar2(1),             /*是否为重覆性生产料件 (Y/N)             */
ima912      number(15,8),            /*标准机器工时                           */
ima913      varchar2(1),             /*统购否                                 */
ima914      varchar2(10),            /*采购中心代码                           */
ima391      varchar2(24),            /*会计科目二                             */
ima1321     varchar2(24),            /*费用科目二                             */
ima1911     varchar2(1),             /*保税料区分                             */
                                     /* (1.保稅正料 2.保稅代用料 3.其它)  #FUN-6A0007*/
ima1912     varchar2(40),            /*原产地                                 */
ima1913     number(20,6),            /*推广贸易服务费                         */
ima1914     varchar2(40),            /*税则                                   */
ima1915     varchar2(40),            /*帐卡编号                               */
ima1916     varchar2(40),            /*保税群组代码                           */
ima1919     varchar2(1),             /*受托加工成品否                         */
ima1401     date,                    /*生效日                                 */
ima915      varchar2(1) DEFAULT '0' NOT NULL, /*是否需做供应商的控制*/
ima916      varchar2(10) DEFAULT ' ' NOT NULL, /*资料来源*/
ima917      number(10),              /*抛转次数                               */
ima150      varchar2(1) DEFAULT ' ' NOT NULL, /*收货替代方式*/
ima151      varchar2(1) DEFAULT ' ' NOT NULL, /*母料件否*/
ima152      varchar2(1) DEFAULT ' ' NOT NULL, /*PO对Blanket PO替代方式*/
ima918      varchar2(1),             /*制造批号管理否                         */
ima919      varchar2(1),             /*制造批号自动编码否                     */
ima920      varchar2(10),            /*制造批号编码原则                       */
ima921      varchar2(1),             /*序号管理否                             */
ima922      varchar2(1),             /*序号自动编码否                         */
ima923      varchar2(10),            /*序号编码原则                           */
ima924      varchar2(1),             /*序号唯一否                             */
ima925      varchar2(1),             /*排序方式                               */
ima601      number(15,3),            /*变动前置时间批量                       */
ima153      number(9,4),             /*工单完工误差率                         */
ima926      varchar2(1) DEFAULT 'N' NOT NULL, /*AVL否*/
ima154      varchar2(1),             /*是否为券                               */
ima155      varchar2(1),             /*是否套装商品                           */
ima149      varchar2(24),            /*代销科目                               */
ima1491     varchar2(24),            /*代销科目二                             */
imaoriu     varchar2(10),            /*资料建立者                             */
imaorig     varchar2(10),            /*资料建立部门                           */
ima9021     date,                    /*开账呆滞日                             */
ima022      number(15,3) DEFAULT '0' NOT NULL, /*量化规格*/
ima251      varchar2(4),             /*量化單位                               */
ima940      varchar2(10),            /*颜色组                                 */
ima941      varchar2(10),            /*尺码组                                 */
ima156      varchar2(1) DEFAULT ' ' NOT NULL, /*号机自动编号否*/
ima157      varchar2(10) DEFAULT ' ',/*号机编码原则                           */
ima158      varchar2(1) DEFAULT ' ' NOT NULL, /*号机库存管理*/
ima927      varchar2(1) DEFAULT 'N' NOT NULL, /*电子采购料件*/
ima120      varchar2(1) DEFAULT ' ' NOT NULL, /*料件性質*/
ima159      varchar2(1) DEFAULT ' ' NOT NULL, /*批号控管方式*/
ima928      varchar2(1) DEFAULT ' ' NOT NULL, /*特性主料*/
ima929      varchar2(40),            /*特性主料编号                           */
ima160      varchar2(1) DEFAULT ' ' NOT NULL, /*称重否*/
ima161      varchar2(40),            /*称重标识                               */
ima162      varchar2(4),             /*称重单位                               */
ima163      varchar2(24),            /*发出商品科目                           */
ima1631     varchar2(24),            /*发出商品科目二                         */
ima721      number(15,3),            /*MRP允许交期延后天数                    */
ima171      number(5),               /*交货预警天数                           */
ima172      number(5),               /*运输预警天数                           */
ima1030     varchar2(10),            /*触屏分类                               */
ima930      varchar2(1),             /*使用条码否                             */
ima931      varchar2(1),             /*包号管理否                             */
ima932      varchar2(1),             /*条码产生时机点                         */
ima933      varchar2(10),            /*包号条码编码原则                       */
ima934      varchar2(1) DEFAULT 'Y' NOT NULL, /*计划性生产*/
ima164      varchar2(24),            /*费用科目                               */
ima1641     varchar2(24),            /*费用科目二                             */
imaud16     number(15,3),
imaud17     number(15,3),
imaud18     number(15,3),
imaud19     number(16,10),           /*PCS面积                                */
imaud20     number(16,10),           /*PNL面积                                */
imaud23     number(16,10),
imaud24     number(16,10),
imaud25     varchar2(20),            /*HDI                                    */
imaud26     varchar2(20),            /*ANYLAYER                               */
imaud27     varchar2(20),
imaud28     varchar2(20),
imaud29     varchar2(200),           /*备注                                   */
imaud30     varchar2(60),
imaud31     number(20),              /*管理有效天数                           */
imaud32     number(5),
imaud33     varchar2(60),
imaud34     varchar2(60),
imaud35     varchar2(20),            /*是否经过工艺测试                       */
imaud36     varchar2(20),
imaud37     varchar2(20),
imaud38     varchar2(20),
imaud39     varchar2(20),
imaud40     date,
imaud41     date,
imaud42     number(16,10),           /*PNL长                                  */
imaud43     number(16,10)            /*PNL宽                                  */
);

create        index ima_03 on ima_file (ima75,ima76);
create        index ima_12 on ima_file (ima12);
alter table ima_file add  constraint ima_pk primary key  (ima01) enable validate;
grant select on ima_file to tiptopgp;
grant update on ima_file to tiptopgp;
grant delete on ima_file to tiptopgp;
grant insert on ima_file to tiptopgp;
grant index on ima_file to public;
grant select on ima_file to ods;
